{
 "put the blue spoon on top of the orange towel": 46,
 "Place the cloth on the far edge of the table": 23,
 "put the blue rectangle in the middle of the table.": 43,
 "put cup from anywhere into sink": 391,
 "put eggplant into pan": 128,
 "open the silver pot": 36,
 "put lid on pot or pan": 533,
 "place the bowl on the cloth.": 31,
 "move the spoon to the backside": 45,
 "Hold the red spatula from above the blue cloth and place it on center of the table.": 34,
 "move bottle to the top on left side of the burner": 24,
 "topple basil bottle cardboard fence": 382,
 "close the drawer": 1397,
 "put the silver pot over the blue cloth": 29,
 "uyhjgthkujh uytg iuygb iuygb iuhyb oiuh oiuh oiuhb oiuh oiujhb iuhb loiuh iuh kijuhn": 48,
 "moves yellow thing from left side to the right side of stove": 46,
 "unfold the cloth from top left to bottom right": 449,
 "Move the yellow object to the right bottom corner of the burner": 27,
 "Place the pot on top of the orange towel": 130,
 "PICK UP THE SPOON AND PUT ANOTHER SIDE OF THE TABLE": 116,
 "moved the silver pot to the right side  of the burner.": 42,
 "put the bowl between the towel and spoon": 37,
 "Move red spoon back and to right of silver bowl": 38,
 "end effector transition from object to object": 176,
 "end effector transition from object to pot or pan": 12,
 "Move pot to front center of table.": 34,
 "put the yellow corn inside the silver pot": 24,
 "Move the red item and place it inside of the bowl.": 42,
 "put the corn in the silver pot": 32,
 "Place the brush behind the cloth.": 46,
 "fold the cloth from bottom right to top left": 613,
 "Move the bowl to the left side of the cloth.": 44,
 "move the orange jar  to the upper center of the countertop": 31,
 "moved the purple cloth to the upper middle of the table": 29,
 "hold the blue object and put  on the top edge of the cloth": 46,
 "put the sushi in the silver pot": 36,
 "lever vertical to front": 331,
 "open the drawer": 2181,
 "move the silver pot below the lid": 40,
 "put sweet potato in pot which is in sink": 240,
 "take the cover of the pot and put in on the upper right side of the stove": 39,
 "move the cloth from bottom left to the top right": 39,
 "unfold the cloth to the top right": 36,
 "put eggplant on plate": 187,
 "flip pot upright in sink": 708,
 "put pepper in pot or pan": 191,
 "put knife on cutting board": 297,
 "turn lever vertical to front": 1509,
 "sweep into pile": 10874,
 "Place the can to the left of the orange pot": 29,
 "put broccoli in pot": 907,
 "fold the cloth from bottom left to top right": 753,
 "places the yellow wash cloth inside the washer": 39,
 "fold the clothe from bottom right to top right": 35,
 "Move the pot to the front left corner of the table": 113,
 "move the towel from the top to the bottom": 30,
 "put the sushi on top of the drawer": 23,
 "Place the knife on the left side of the basin": 37,
 "Grab the toy with white base and red top, that is in the silver bowl.  Move to the top left.": 34,
 "put carrot in bowl": 88,
 "move the silver pot to the top right burner": 34,
 "put the cube on top of the blue rectangle.": 46,
 "Place the red scooper on the front right corner of the counter.": 42,
 "open fridge": 1070,
 "move the silver bowl on the lower right burner": 34,
 "Move the red measuring cup to the right of the blue spoon.": 44,
 "Place the orange towel on the front right corner of the table": 39,
 "closed  the drawer": 41,
 "moved the silver pot to the left side burner": 34,
 "Move the blue figure from the top right edge of the cloth on the table beside a purple bucket.": 43,
 "move the purple cloth to the lower right side of the table": 33,
 "open large4fbox flaps": 110,
 "unfold the cloth from right to left": 389,
 "folded the cloth from left to right": 42,
 "put the yellow object in the silver pot": 36,
 "pick up pot": 546,
 "pick up pan from stove": 195,
 "turn faucet front to left": 362,
 "put the fish on the lower left of the stove": 31,
 "close large4fbox flaps": 135,
 "fold cloth from top to center": 38,
 "Open the drawer": 280,
 "take the orange item and put it on the left side of the styove": 38,
 "take the thing out of the drawer and put it on the left side of the table": 94,
 "put the white basket on top of the blue cloth": 31,
 "take carrot off plate": 1026,
 "put cup from sink to drying rack": 63,
 "Put the napkin right in front of the cans.": 23,
 "put sushi in pot cardboard fence": 360,
 "take the corn out of the draw and place it above the sushi": 38,
 "moved the orange basket to the lower left part of the table": 34,
 "put potato in pot or pan": 122,
 "Move cheese to the bottom right": 44,
 "upright basil bottle cardboard fence": 418,
 "put carrot on plate": 1337,
 "pick the spatula and place it on purple cloth": 32,
 "moved the strawberry near the drawer": 31,
 "fold blue cloth from top left to bottom right": 38,
 "Place the chicken leg on the green cloth.": 40,
 "put pot or pan in sink": 160,
 "take the yellow thing in the silver pot and put it to the top of right burner": 46,
 "take the yellow duck and place it inside the drawer": 27,
 "move block from top of the tower": 46,
 "opened the drawer": 209,
 "take lid off pot": 422,
 "Move the purple cloth from right side to left side on the table": 29,
 "unfold the cloth from left to top right": 26,
 "turn faucet right": 756,
 "move the blue elephant to the top of the box": 20,
 "put pot on stove which is near stove": 424,
 "fold the cloth from top right to bottom left": 380,
 "Place the red spoon on the yellow towel": 38,
 "fold cloth right to the center then from the left to the center": 33,
 "move the green cloth to the right side of the table": 26,
 "Move green spatula to the left side of blue cloth": 42,
 "Move the white object to the right side of the table.": 27,
 "close fridge": 640,
 "take the green object from the silver pot and put it to the top left side of the violet can": 30,
 "pick up bowl and put in small4fbox": 126,
 "moved the yellow knife to the left bottom corner of the table": 42,
 "take the red object above the yellow towel and put it inside of the pot": 36,
 "moved the brown pot to the lower left corner": 37,
 "move the silver pot to the right burner": 62,
 "open oven": 689,
 "move the blue object from the pot to the upper right of the stove": 25,
 "move the cloth to the right side of the table": 28,
 "move the silver pot to the upper right corner of the table": 44,
 "unfold the cloth from top right to bottom left": 727,
 "fold the yellow cloth from left to right": 76,
 "put the green arch on the white arch": 46,
 "take the tomato out of the silver pot and move it to the left side of the burner": 24,
 "Place the napkin on the right front corner of the table.": 38,
 "unfold the cloth from left to right": 304,
 "fold cloth from top right to bottom left": 54,
 "pone la tapa en la olla": 31,
 "moved the yellow cloth in the middle of the stove": 32,
 "open the lip of silver pot  and move to the right side": 26,
 "put corn in pan which is on stove": 423,
 "take the black object inside the drawer": 18,
 "put the green block on top of yellow block": 46,
 "put the grey object on top of the drawer": 23,
 "put spoon on plate and croissant in pot or pan in sink": 69,
 "move the silver bowl to the upper right side of the table": 32,
 "moved the can in between the two burner": 34,
 "move the red triangle to the left": 46,
 "put green squash into pot or pan": 110,
 "move the towel to the right burner.": 27,
 "move the blue spatula to the right side of the burner": 46,
 "put the gray object in the drawer": 29,
 "move the thing on the top of the drawer": 27,
 "move the yellow cloth to the top right corner of the stove": 26,
 "Put the pan on the lower right corner of the table": 46,
 "flip pot upright which is in sink": 170,
 "moved the orange object from the top of the drawer to the upper right of the table": 27,
 "Put the yellow cube at the top of the cylinder": 46,
 "put the broccoli inside the silver pot": 36,
 "Move yellow-handled knife left and away from the edge of the table.": 37,
 "pick the red hexagon block  from the white rectangle block and put it on top of the white cylindrical block": 46,
 "Move the green handled item to the top of a pot": 31,
 "moved the silver pot to the upper right part of the bright urner": 28,
 "moved the green towel beside the pot on the left of it": 33,
 "take cucumber out of cup": 200,
 "close microwave": 1285,
 "move the white cloth to the bottom table": 38,
 "take the brown bunny out of the drawer and put it on the bottom middle part of the table": 42,
 "Put the blue block onn top of the red block": 46,
 "take bowl off plate cardboard fence": 144,
 "Moving the pot and the purple sponge towards the right hand side of the table": 29,
 "put clothes in laundry machine": 423,
 "moved the cucumber to the lower left of the stove": 29,
 "Move the chicken leg in the silver pot that place on the top of the orange towel": 45,
 "put the white block on top of the longer white block": 46,
 "move the blue object to the upper right of the table": 30,
 "Put the yellow cube on top of the blue rectangle": 46,
 "upright metal pot cardboard fence": 510,
 "take the pink object out of the drawer and place it on the bottom center of the table": 28,
 "put pot or pan on stove and put potato in pot or pan": 220,
 "put pear in bowl": 615,
 "put the orange object in the drawer": 73,
 "moved the knife from the left yellow dish rack to the upper left side of the sink": 43,
 "move the tin to the edge of the table": 27,
 "place the ball on top of the blue arch": 46,
 "fold the cloth from right to left": 390,
 "put spoon into pan": 114,
 "put out the yellow figure on the cloth": 39,
 "pour almonds in pot": 1366,
 "move  the orange fork to the right corner": 42,
 "unzip zipper bag": 111,
 "put corn in pot which is in sink": 237,
 "put eggplant into pot or pan": 141,
 "place the cube on top of the arch": 46,
 "move the yellow knife in the left burner": 21,
 "Place the green pickle on top of the yellow towel": 42,
 "put the chess piece on top of the square with a hole": 41,
 "put carrot in pot cardboard fence": 351,
 "Place the metal bowl in front of the green cloth.": 30,
 "unfold the cloth from the right to the left": 64,
 "move the red pan to the basket on the left": 44,
 "put the purple object on top left of the cloth": 28,
 "Move the spoon from corner to other side of the table.": 42,
 "move orange cloth to the bottom": 29,
 "place the brown figure on the bottom left of the cloth": 29,
 "close low fridge": 183,
 "move the red thing to on the drawer": 28,
 "Pick up this spoon and place it onto the left of the piece of cloth.": 28,
 "Move the blue cloth so that it sits in front of the microwave, between the metal pot and the spoon.": 27,
 "put sushi on plate": 462,
 "move the objet to the right side of burner": 38,
 "unfold the cloth from bottom right to top left.": 38,
 "take the black and white object to the top right side of the stove": 34,
 "open microwave": 1455,
 "put the spoon in the pink plate": 41,
 "put the red object on top of the yellow block": 42,
 "move the banana from the cloth to the right upper corner of the stove": 30,
 "put grey on top blue": 46,
 "spreading cloth": 41,
 "open brown1fbox flap": 142,
 "move the yellow brush to the left side of the yellow cloth.": 35,
 "put the blue block to left side of the table": 38,
 "move the silver saucepan to the upper left burner": 32,
 "fold the cloth from bottom to top": 309,
 "put cap on container": 145,
 "move the banana from the top left to the bottom left": 31,
 "put pan on stove and put stuffedduck in pan": 196,
 "take the eggplant and put it between the two right burners": 144,
 "move the yellow object to top between the two burners": 35,
 "closed the open drawer": 75,
 "move the blue ladle to the bottom left of the stove": 22,
 "Pick up the pot and place it on the right of the red fork": 43,
 "Put the ball with hole to the cup": 43,
 "move the red rectangle from one tower to another": 46,
 "lifted the yellow spoon on the lower left corner of the table and put it down on the same place": 101,
 "move the purple towel to the right burner": 26,
 "move the green object to the bottom left of the burner": 42,
 "take beet from pot sink": 151,
 "put potato on plate": 289,
 "Move the corn slightly to the right": 24,
 "put pan from sink into drying rack": 126,
 "Move the green cloth behind the green fruit": 46,
 "fold the cloth from top left to bottom right": 557,
 "pick up green mug": 165,
 "move the silver lid to the bottom left side of the table": 28,
 "place the red cloth on the far right of the table": 33,
 "Move pot to middle of yellow cloth.": 46,
 "Move the pot on top of the blue cloth.": 36,
 "moved the white basket to the right": 34,
 "open small4fbox flaps": 102,
 "pick the blue toy from middle to corner": 46,
 "moving the knife on the top left side of the banner": 50,
 "moved the cloth slightly around the table": 25,
 "Place the orange towel to the left of the blue fork": 38,
 "Place the green-and-yellow item at the table's lower right corner.": 45,
 "Pick up the green spatula and place it on the left of the pot": 39,
 "put detergent in sink": 266,
 "moved the yellow object from the top right side of the stove to the top left side": 35,
 "folds the cloth from bottom left to top right": 40,
 "placed the orange clothe on top of the stove": 31,
 "Put the pot on the blue cloth.": 29,
 "open book": 121,
 "move the yellow object to the bottom right of the table": 24,
 "Move the pot to the left of the cloth.": 30,
 "unfold the cloth from the top left to bottom right": 31,
 "move the stove to top left of burner": 37,
 "Place the blue utensil to the left of the silver pot.": 46,
 "put the lid on the silver pot": 64,
 "Move the pot bottom left of table": 36,
 "unfold the cloth": 85,
 "Place the white donut in the pot": 30,
 "move the silver pan to the left bottom stove": 28,
 "end effector reaching pot or pan": 129,
 "move the green cloth to the bottom right of the stove": 27,
 "Move wok to space above orange cloth.": 40,
 "Put the brush on the right next to the pot.": 27,
 "move the pink thing from cloth to the left side of table": 43,
 "put lid on pot": 432,
 "fold cloth in half": 147,
 "put spoon in pot": 100,
 "move the pot lid to the top side of the table": 25,
 "take the broccoli out of the pot and put it on the top of the yellow towel": 34,
 "Move the blue cloth from the left of the plate towards the top right of the table.": 28,
 "place the white cylinder on top of the tower": 42,
 "fold the cloth from left to right": 577,
 "Move the pot to the bottom right corner.": 34,
 "wipe pot with sponge": 137,
 "Move the pot to the front left corner of the table.": 21,
 "move the rectangle to the left": 46,
 "move the grey doll from top of the drawer to the left side of the red bell paper": 22,
 "open low fridge": 199,
 "Place the mushroom in the pot": 29,
 "take cup off plate": 198,
 "move the white object to the right side of the stuffed monkey": 38,
 "Take the red capsicum and put it in the stainless steel pan": 39,
 "take the ring off of the cylinder and put it on the right side of the table": 43,
 "move the vessel to the center of the table": 42,
 "removed the figure from the bottom left of the cloth to the table": 27,
 "put red bottle in sink": 181,
 "move the yellow item to the left top of cloth": 35,
 "fold the cloth from bottom right to the center": 68,
 "move the maize corn to the bottom right of the stove": 40,
 "put the mushroom in the silver pot": 83,
 "place the stick on top of the block": 46,
 "put pickle in pot or pan an put pot or pan on stove": 73,
 "close cabinet": 174,
 "put the yellow knife to the right side of the stove": 46,
 "Move the purple cloth behind the metal pot.": 31,
 "put the white object in the pot": 50,
 "pick up any cup": 144,
 "move the can to the upper left side of the table": 50,
 "turn faucet left": 294,
 "take sushi out of pot cardboard fence": 401,
 "move the banana and place it behind the fork": 43,
 "moves blue fork to the right side of can": 45,
 "put the can behind the knife": 37,
 "move the yellow bottle in the upper left side": 45,
 "put cucumber in cup": 221,
 "Move the silver pot in front of the right burner": 33,
 "take clothes out of laundry machine": 424,
 "put the blue arch block on top of the cup": 46,
 "moved the silver pot to the left side of the table": 34,
 "put pot or pan on stove": 122,
 "put the yellow cube on top of the cylinder": 33,
 "Put the lemon on the right side of the green spatula": 42,
 "puts the blue object on the top edge of the burn": 39,
 "put the pot on the right side of the table": 31,
 "put the blue spoon between the red thing and blue cloth": 54,
 "move the silver pot to the right side stove": 43,
 "fold the cloth form right to left": 28,
 "put eggplant in pot or pan": 235,
 "put bowl on plate": 154,
 "put the red cube on top of the  blue cube": 42,
 "TAKEN THE POLASTIC BOWL PUT IN THE GREEN TOWEL": 30,
 "take the knife and place it to the right edge of the table": 45,
 "move the blue object to between the stove and the sink": 39,
 "Move white object to front edge of counter left of spatula": 46,
 "take the orange cloth and put inside the white basket": 36,
 "Move yellow cloth near to the wall": 39,
 "put banana in colander": 165,
 "move the blue spatula to the top right side stove": 45,
 "Move the can behind the blue fork": 36,
 "PICKLUP THE TOMATO AND PUT NEAR THE VIOLET TOWEL": 43,
 "pick up the pink toy and put it on top of the drawer": 31,
 "Put the blue spoon on the blue towel": 37,
 "put banana on plate": 135,
 "moved the potato from the bottom right burner and kept it on the top left burner": 33,
 "take sushi out of pan": 171,
 "take lid off pot or pan": 269,
 "move a red thing from the front of the drawer to the side of the drawer": 28,
 "put the brown thing in the drawer": 33,
 "take the black thing and put it on burner of the stove at the right": 26,
 "put the red spoon between the two burner on the left side": 45,
 "Place the sushi on top of the green towel": 41,
 "put cauliflower in pot or pan an put pot or pan on stove": 118,
 "move the tin from the top left side to the top right side of the table": 21,
 "move the silver pot in the left side corner of the table": 34,
 "put pan on stove and put blueberry in pan": 289,
 "Put the brush between the two lower burner": 48,
 "moved the cooking from inside the sink to the left side of the sink": 46,
 "pick up sponge and wipe plate": 156,
 "moves an orange cloth from the washing machine": 31,
 "put the red box": 45,
 "open drawer of box": 108,
 "put cup from counter or drying rack into sink": 91,
 "put banana in pot cardboard fence": 355,
 "picked up the black and white object and put it in the silver pot": 18,
 "put the yellow knife on the upper side of left burner": 46,
 "Move the towel to in front of the cans of sauces.": 18,
 "take the rectangle block and place it on top of the other rectangle block": 46,
 "put pan on stove from sink": 126,
 "take the lid and put it on the pot": 25,
 "take the object above the drawer and put it inside the drawer with a blue cloth": 18,
 "put strawberry on plate and stuffedduck in pot or pan in sink": 76,
 "put potato in pot cardboard fence": 360,
 "Place the steel pan near the the spoon.": 40,
 "Move the silver pot to the bottom right of the table": 38,
 "\"move the blue fork to the top right of the table\"": 33,
 "Turn fork sideways and put it at the bottom of the table": 45,
 "unfold the cloth from bottom right to top left": 403,
 "move the blue spoon to the upper side of the stove": 46,
 "put the towel over the fork": 31,
 "place a broccoli on top of the drawer": 24,
 "Move the blue spoon on the far edge of the table.": 40,
 "put carrot in pot or pan": 155,
 "move object and place over blue object": 35,
 "Place the yellow brush so the head is on the burner.": 34,
 "Take the blue towel and put it in the washing machine": 39,
 "put the teddy in the drawer": 27,
 "put the ball in the cup": 323,
 "taken out of a bottle in a drawer": 46,
 "moved the red object and placed it  in the silver bowl on the left side": 30,
 "put lid on stove": 179,
 "close oven": 582,
 "Put the pot on the left hand side of the stove.": 34,
 "move the salmon from the pot to the right of the blue cloth": 29,
 "put the rectangular block with red mark on top of square block with a hole": 46,
 "take spatula off plate sink": 194,
 "put the cube with stick on top of the two cubes": 42,
 "unfold the cloth from top left to the bottom": 26,
 "put the blue block on top of the red arch": 40,
 "move the cloth from bottom left to top left": 22,
 "Put the metal pot in front of the blue cloth.": 34,
 "move the spatula and put it on the blue towel": 27,
 "unfold the orange cloth from right to left": 31,
 "pick up bit holder": 113,
 "place the object that is black spotted inside the pot": 33,
 "Place the metal pot on the purple cloth.": 76,
 "move white toy diagonally from top to bottom little bit towards left": 46,
 "Move yellow cloth next to red spoon": 41,
 "unfold the cloth from the middle to the top": 39,
 "moved the red fork to the bottom right of the burner": 30,
 "Put the red figure on the top edge of the cloth": 42,
 "move the can to above the fork and spoon": 35,
 "move the white mushroom to the top of the broccoli": 38,
 "picks the white round object from the blue towel to the right side of the table": 25,
 "put the purple cloth in the washing machine": 74,
 "Move the fish to the lower right edge of the table": 43,
 "Place the mushroom into the pot": 83,
 "Move the teal utensil to the left of the cloth": 30,
 "put the silver pot on top of the purple cloth": 33,
 "Put the blue cloth behind the metal pot.": 27,
 "lift bowl": 83,
 "Move the ladle to the back left corner of the stove": 23,
 "move brush to bottom of stove": 56,
 "pick red spoon and place it on the left corner of the table": 46,
 "put blue cube on cylinder": 42,
 "picked up  the silver pot and put it on the lower center of the table": 29,
 "put broccoli in bowl": 71,
 "move the blue cloth to the right of the yellow brush": 28,
 "move the red spatula in the bottom side of the table": 44,
 "moved the green object on top of the blue cloth": 28,
 "fold the cloth from left to top right": 73,
 "put the red fork on the top of stove": 46,
 "Hold the green spatula from right edge of the table and place it on top right edge of the table.": 46,
 "move the pot in front of the yellow napkin": 26,
 "put the blue spoon on the bottom right burner": 48,
 "pick up the silver pot and put into the blue towel": 23,
 "unfold the cloth from the top right to the bottom left": 167,
 "put potato on plate and strawberry in pot or pan in sink": 76,
 "put the object other of the table": 46,
 "move the blue fork to the left burner": 46,
 "move the pepper from bottom right to top left": 45,
 "move the cloth from left to right": 179,
 "closed the drawer": 229,
 "put strawberry in pot": 118,
 "Move the can behind the fork and spoon": 39,
 "put the blue spatula on the top right burner": 27,
 "unfold the blue cloth from top right to bottom left": 36,
 "move the yellow block to the middle of the table": 41,
 "put the cone on the center of the table": 46,
 "take the rubber chicken and put it on the left side of the table": 26,
 "Place the pot between the red spoon and yellow towel": 28,
 "move the yellow duck to the bottom left side of the table": 19,
 "Place the chicken wing in front of the silver pot.": 35,
 "move the silver pot to the bottom middle of the table": 34,
 "move the cloth from left side of the stow to right": 19,
 "put the spoon at the right burner": 22,
 "Pick up the white utensil and place it in the silver pot.": 35,
 "Put a silver lid from the silver pot and move it to the upper left of the table": 35,
 "Move potato to front right corner of stove top": 30,
 "put the stainless pot  in the pot on the left burner": 48,
 "Move the metal container to the top left burner": 29,
 "NOT MOVING ANYTHING": 85,
 "put blueberries on plate sink": 191,
 "Place the yellow cloth on the far edge of the table": 29,
 "moved a green object to right side of towel": 32,
 "move the bowl to the bottom left of the table": 46,
 "Put the red spoon in the pot": 45,
 "put the green object in the pocket of the blue sink": 54,
 "Unfold the cloth from top left to bottom right": 83,
 "moved the green orange bottle to the middle bottom of the table": 22,
 "fold the cloth from the top right to  the bottom left": 34,
 "Take the Orange cloth from the basket and put it on the right side of the table.": 24,
 "removed broccoli from drawer and put next to banana": 46,
 "move orange bottle into the bowl": 33,
 "Move the mushroom towards the right end off the table.": 33,
 "topple metal pot cardboard fence": 414,
 "put the silver lid to the silver pot": 46,
 "take bowl off plate": 149,
 "open the wooden drawer": 36,
 "unfold the cloth  from top left to  bottom right": 46,
 "take the blue fork and put it on the right side of the cooker": 32,
 "Place the pot on top of the violet cloth.": 41,
 "fold the cloth from left top to the rigth bottom": 28,
 "Place pot on top of orange towel": 46,
 "Move the silver pot to the right side of yellow brush": 26,
 "Move the blue cloth to the left of the silver bowl": 32,
 "Move the brown cylinder to the table": 46,
 "Pick up the blue tube and place it on the left of the red spoon": 45,
 "Pick up the spoon and put it on napkin.": 32,
 "It did nothing": 43,
 "put bowl on plate cardboard fence": 157,
 "Pick a red object and place in the drawer": 46,
 "move the orange pot to bottom left side of the table": 43,
 "Move pot to bottom right of table.": 34,
 "moved the blue cloth further left next to the spoon": 83,
 "Place spoon on orange cloth, positioned up and down.": 27,
 "put stuffedduck in pan": 111,
 "put red toy on the vessel": 22,
 "Pick the yellow square block and put it above the red square block": 44,
 "end effector reaching salmon": 64,
 "Move the purple cloth to the right of the silver pot.": 38,
 "put the silver pot between the left stove and the sink": 42,
 "move bucket into the sink": 53,
 "put the the green cube on top of the red cube": 46,
 "The robot arm folds the cloth from the bottom to the top": 33,
 "move blue towel to upper right of table": 18,
 "Moved the towel at the top right side of table near the comb": 29,
 "Put the oval item at the table's right edge.": 40,
 "place the meatpie on top of the blue cloth": 30,
 "move the silver pot to the upper right corner of the stove": 41,
 "put the silver spoon in the silver pot": 56,
 "close the drawer.": 85,
 "put spatula in pan": 147,
 "pick up the green object above the drawer and place it on the table": 38,
 "Move the red fork to the right of the cloth.": 35,
 "Place the eggplant in the metal pot.": 45,
 "put the rectangular block on top of the yellow and blue cubes": 46,
 "put redpepper on plate and brush in pot or pan on stove": 76,
 "take corn out of bowl sink": 179,
 "move the orange object to the top of the pan": 24,
 "Grab the blue spatula": 46,
 "take the object on the drawer and put it on the lower middle side of the table": 26,
 "placed blue rectangle block on the arch": 44,
 "move the orange pot with the broccoli inside and place it to the left side of the can": 37,
 "put corn on plate": 173,
 "fold the cloth from the top left to the bottom left": 39,
 "fold the fabric to the left": 28,
 "put carrot on cutting board": 118,
 "moved the cloth to the bottom left edge of the table": 46,
 "moved the blue cloth to the bottom of left burner": 28,
 "NOT MOVING ANITHING": 29,
 "take the red object out of the pot and put it on the left burner": 339,
 "pick up pot from sink": 142,
 "take the red pepper out of the drawer and put it on middle of the table": 35,
 "fold the cloths from top to bottom": 18,
 "put small spoon from basket to tray": 156,
 "put knife in pot cardboard fence": 402,
 "Move the red pepper to bottom middle of stove": 36,
 "fold the cloth from bottom  to top": 34,
 "put lemon on plate": 180,
 "put pan from drying rack into sink": 122,
 "place the silver pot in the middle of the table": 38,
 "Move the blue fork to the left of the pot": 46,
 "move the purple cloth in the left side burner": 28,
 "Move the green towel to the front edge of the table": 22,
 "put the salmon meat in yellow pot": 36,
 "move the yellow plastic to the lower right of the stove": 33,
 "retira pimentão vermelhor do queimador e coloca pimentão ao centro do fogão": 27,
 "Place the prawn in the pan.": 31,
 "put the yellow rectangular block on top of the hole": 39,
 "Place spoon on top of cloth.": 33,
 "pick the blue spoon to the right side of the buner": 35,
 "open and closing the drawer": 35,
 "move the pot put on the peeler": 32,
 "put the banana on the right edge of the cloth": 26,
 "moved the blue can to the bottom right of the table.": 48,
 "put the small can in the right top of the bleu cloth": 54,
 "Place the red vegetable to the right front of the blue utensil.": 44,
 "take broccoli out of pan": 1015,
 "move the cylinder on top of the cube": 45,
 "put broccoli in pot or pan": 227,
 "Bring the violet cloth to the front edge of the table.": 32,
 "end effector reaching banana": 32,
 "put sweet potato in pot": 118,
 "move blue spoon on the lower left side of the table": 35,
 "unfold from top to bottom": 30,
 "put one block on top of another block": 33,
 "move the can to the right side of the wooden table": 22,
 "Put the blue cloth in the washing machine": 37,
 "move the silver pot to the left side of the right burner": 56,
 "Move the bowl to the right of the cloth.": 39,
 "moved the green spatula to left side stove": 37,
 "moved the spoon on the lower right side of the stove": 27,
 "Take mushroom out of the pot and place it near the bottom of the table.": 28,
 "put the object in the top of an object": 40,
 "move the orange pot to the top left of the table": 36,
 "put the yellow cloth in the white basket": 31,
 "move the pot to the bottom right side of the table": 34,
 "move spoon onto towel": 28,
 "Put the cloth near the microwave": 32,
 "put knife in pot or pan": 119,
 "Placed the yellow block on the very left side of the table.": 41,
 "open cabinet": 193,
 "take the rectangular block from another rectangular block and stacked it on top of the block with an arch": 46,
 "put cup from drying rack to sink": 42,
 "Move the leg piece and put it in the kadai.": 33,
 "put the blue fork on top of the brown pot": 51,
 "move the blue fork to the center left side next to the two burners": 25,
 "moved the wooden spatula to the right side of the sink": 90,
 "move the red plastic pot to the middle of the sink": 31,
 "take the blue cloth and wipe the washing machine with this cloth": 34,
 "Move the blue cloth to the left of the yellow bell pepper": 36,
 "was going to put the blue object in the drawer": 46,
 "move the green towel to the lower right side of the right burner": 15,
 "move the orange pot to the left side of the table": 30,
 "put the white object in the table": 37,
 "unfold cloth from the bottom to the top": 37,
 "ufgdh": 33,
 "put egg in pot or pan an put pot or pan on stove": 64,
 "move the yellow toy cheese from the top of the drawer to the center of the  table": 31,
 "move the duck toy on the top of the drawer": 23,
 "Move the knife to the top left corner of the table.": 46,
 "move something": 53,
 "moved silver pot from right burner to the bottom right of the stove": 24,
 "move the silver pot to the lower left side of the stove": 42,
 "move yellow vegetable from pan to other side near blue spoon": 46,
 "Move the pan down to the left of the drain cover": 29,
 "move the cloth from the edge of the table to the center": 44,
 "put knife on cutting board cardboard fence": 410,
 "put the black and white object onto the table": 32,
 "move the pot to the top left burner": 31,
 "move the silver pot to the middle of the sink": 49,
 "put the green object inside the drawer": 76,
 "move the red fork to the left side of the stove": 35,
 "put the forceps on the middle table": 37,
 "move the cloth from bottom right to top left": 71,
 "put the the red hexagonal block to the center of the table": 46,
 "take the pot on the upper right of the burner and move it on the green cloth.": 38,
 "unfold the cloth right side to the left": 34,
 "put the white cube on top of the blue block": 46,
 "Move the blue spoon to the bottom left corner of burner": 32,
 "put the potato on the left burner": 33,
 "Move the blue cloth to the centre of the table": 44,
 "put the corn to the left of the yellow cloth": 29,
 "move the silver basket to the right burner": 50,
 "fold the cloth from bottom right to the middle": 66,
 "Move brush to back right side of stove top": 24,
 "Take the yellow pepper out of the pot and place it to the top left.": 46,
 "push the white can in front of the microwave and put blue spoon in the middle of the table": 40,
 "move sushi to  the bottom side of the right burner": 24,
 "PICK UP THE SPOON KEEP NEAR TO THE WHITE TOWEL": 43,
 "Place the yellow spoon behind the metal pot.": 28,
 "move the spoon into lower left side of the table": 35,
 "Place the red spoon to the left of the pot": 42,
 "flip cup upright": 427,
 "Move the red spoon to the left of the pot": 92,
 "move the toy down": 27,
 "moved the silver bowl to the upper right of the table": 41,
 "moved the silver pot above the right burner": 33,
 "Move the blue spoon to below the orange cone and to the right of the silver bowl.": 29,
 "take spoon out of bowl sink": 194,
 "put corncob on plate and strawberry in pot or pan on stove": 122,
 "Unfold the cloth from bottom right to top left.": 46,
 "put fork from basket to tray": 182,
 "move the pot to the left side of the stove": 46,
 "move can to top right burner": 33,
 "move the blue object to the right side of the burner": 27,
 "maintain the object of blue color": 46,
 "moved the tray to the right side of the floor": 28,
 "open the drawer.": 46,
 "put the blue towel on the white basket": 36,
 "open the silver pot and put lid on the lower left side of the table": 43,
 "put pot or pan on stove and put pickle in pot or pan": 140,
 "Place the silver pot on the blue cloth.": 33,
 "remove wooden spoon from silver bowl": 50,
 "close drawer of box": 82,
 "Put the pan on the blue cloth": 41,
 "put the green cube in the middle": 45,
 "put the pot on a kitchen towel": 24,
 "move the blue spatula to the right side of the table": 36,
 "moved the yellow towel to the upper middle side of the table": 20,
 "move the can to the top ide of the mettle pot": 28,
 "Pick up the carrot and place it on the purple cloth": 20,
 "he takes the orange object and places it on the chest of drawers": 26,
 "Move the yellow cloth to the top side of the burner": 26,
 "pick up red srewdriver": 97,
 "put the spoon on the table": 28,
 "move the cloth to the top left of the table": 38,
 "open white1fbox flap": 121,
 "put an object in the drawer": 63,
 "put corncob on plate and cucumber in pot or pan in sink": 144,
 "put the wooden spatula in the left side of the sink": 45,
 "unfold the cloth from the bottom right to the  left": 46,
 "Place the pickle on top of the yellow towel": 28,
 "put pot or pan on stove and put cauliflower in pot or pan": 136,
 "put pot or pan on stove and put strawberry in pot or pan": 152,
 "put pot or pan on stove and put egg in pot or pan": 133,
 "moved the corn on top of the green cloth": 23,
 "fghgfjf": 37,
 "move the can from the top right side to the bottom right side of the table": 32,
 "put the pot on the bottom right burner": 34,
 "Move the pot to the left bottom corner of the table.": 43,
 "make something": 33,
 "put green squash in pot or pan": 159,
 "move the blue spoon on top of the switches": 44,
 "end effector transition from pot or pan to object": 64,
 "put the green cube on top of the tower": 46,
 "take the cheese out of the drawer and put in the middle left side of the table": 46,
 "move faucet front to left": 63,
 "take the  object out of the pot and put it on the left burner": 41,
 "Pick up the pan and move it to the opposite corner": 39,
 "remove the blue cube from the tower and put it on the table": 39,
 "put pot in sink": 125,
 "moved the red spoon to the left side of the table": 36,
 "unfold the fabric from right to left": 28,
 "put can in pot": 200,
 "Place the yellow cloth on the top left corner": 42,
 "Place the pot on top of the green towel": 61,
 "Moved the can above the plastic knife.": 35,
 "move broccoli below microwave": 27,
 "Move pot and place to the bottom left of towel": 32,
 "fold the cloth from right to the center": 40,
 "put the block on top of the arch": 43,
 "moves the plastic spoon to the right middle side of the table": 52,
 "put the yellow thing in the silver pot": 27,
 "put the blue figure on the top edge of the cloth": 354,
 "move the silver pot over the upper left stove": 32,
 "take the red object out of the drawer": 46,
 "put the purple towel in the washing machine": 46,
 "move the pink and green object to the top of the spoon in the center of the table": 36,
 "moved the orange object from the right pot to the left pot": 47,
 "put the can to the left side of the yellow towel": 40,
 "Put the silver pot to the center of the table": 44,
 "put the panda in the pot": 44,
 "fold cloth from the bottom right to the top": 40,
 "get the rectangular and put on the left": 39,
 "Move the silver pot to the front right of the red fork.": 46,
 "put the right square cube onto the arch and rectangular blocks": 46,
 "Move the teal colored object on the top of yellow object": 46,
 "Move the mushroom in front of the microwave to the left of the pot.": 36,
 "Move the pan and place it on the yellow cloth": 46,
 "Pick up the green peppers and move it from the back of the stove to the front of the stove.": 28,
 "move the yellow cloth to the right side burner": 29,
 "put the red pepper in the left burner": 31,
 "Remove the pear from the pot and place it on the right back corner of the counter.": 39,
 "Put the cube with a hole on the table": 38,
 "Move the blue cloth behind the crackpot with eggplant": 32,
 "put the silver pot to the down right burner": 46,
 "Move the spoon to the front of the cans": 27,
 "pick up the blue cloth then put it inside the washing machine": 38,
 "move cloth to the left behind the pot": 19,
 "move the blue cloth to the bottom right corner": 17,
 "move the pot lid to the bottom left side of the stove": 24,
 "Take the blue triangle and put it top on the yellow cube": 46,
 "Move the pot and place it just beneath the knife.": 46,
 "Move the can to the top left corner of the table.": 28,
 "move the green object to the upper right of the table": 36,
 "move wooden spoon to the center of burners": 49,
 "Put the oval with a hole on top of the red cube": 42,
 "put pot or pan on stove and put stuffedduck in pot or pan": 139,
 "put pot or pan on stove and put blueberry in pot or pan": 199,
 "unfold the cloth from  bottom to top": 36,
 "put pepper in pan": 130,
 "no move": 31,
 "moves silver lid from lower  side of the burner to the top of the lid": 38,
 "Remove the pawn from top of the box with a hole and place it down on the right side": 44,
 "remove the yellow banana form the drawer and put on the bottom right side of the table": 36,
 "move the silver pot to the upper right of table": 101,
 "remove the violet cloth inside the basket then put it on the floor in the right side of the basket": 38,
 "move the yellow thing": 32,
 "unfold the cloth from the top to the bottom": 127,
 "put the green item into the silver pot": 30,
 "move the green cube further down the table": 37,
 "Put ladyfingers on cloth.": 36,
 "moved the green cloth to the left burner": 33,
 "Picks up cheese and puts it into pot": 36,
 "move yellow knife to the left of the stove": 34,
 "touch the block": 23,
 "put spatula on cutting board": 92,
 "mettre la figure vert sur le bord supérieur du tissu": 32,
 "move blue spoon little bit right": 28,
 "move the yellow pepper from the left bottom burner to the middle of the stove": 31,
 "moved pot between stove and sink": 31,
 "remove the yellow cube off of the cylinder": 46,
 "Pick up the spatula and put it in front of the microwave.": 30,
 "move the cylinder to the top middle of the table": 33,
 "move the fork into the top burner": 43,
 "take the yellow thing and put it  out of the drawer": 21,
 "put the silver pot to the bottom right burner": 26,
 "Put the chicken on the purple cloth.": 30,
 "Place the colander to the right of the blue spoon": 39,
 "Move the can from the top left of the burner to the bottom left of the burner": 30,
 "put the green capsicum between the burners": 19,
 "Fold the cloth from right to left.": 28,
 "Move the spoon to the right of the pan.": 46,
 "opening the drawer": 24,
 "fold the cloth from top to bottom": 124,
 "put the silver pot on the purple cloth": 28,
 "Put the pot on the cloth.": 114,
 "Move the can to the back of the counter": 40,
 "remove the red block from the tower and put it on the right side of the table": 42,
 "pick the orange monkey and put it above the metal pot": 29,
 "take carrot out of pot cardboard fence": 420,
 "Close the drawer": 201,
 "Move the blue cloth up and down the right side of the table": 75,
 "put eggplant on plate and spoon in pot or pan on stove": 288,
 "move the red cloth to the upper right side of the stove": 22,
 "Pick up the pot and put it under the yellow can and next to the stove.": 28,
 "put the green figure on the top edge of the cloth": 38,
 "move the silver pot to bottom left side on the table": 25,
 "move the blue fork to the top right burner": 36,
 "pick up glass cup": 229,
 "put pear on plate and blueberry in pot or pan in sink": 76,
 "unfold the cloth in rigth to left": 39,
 "remove the ball from the cup and place it on the table": 42,
 "move the white plastic plate and places it on the yellow piece": 30,
 "move the silver pot to the bottom left of the table": 29,
 "take the rectangular and put it in the other rectangular": 39,
 "put corn into bowl": 150,
 "Move the blue towel between the cans and the pot": 27,
 "Put the egg near the spoon.": 37,
 "nothing happened in this image": 32,
 "put the toy on top of the drawer": 26,
 "pick up scissors and put into drawer": 158,
 "put the pot lid over the purple towel": 26,
 "put pot or pan on stove and put corncob in pot or pan": 140,
 "put the yellow duck in the drawer": 114,
 "end effector reaching corn": 48,
 "moved the plastic spatula to the upper left side": 40,
 "placed the blue ribbon on the blue towel": 22,
 "move the right cube to top of the top rectangle block": 46,
 "opening the lid and put it on the table": 28,
 "Move the potato to the top right corner of the stovetop above the blue spoon.": 26,
 "Move the red fork to the near left corner of the table.": 46,
 "put the banana into the silver pot": 36,
 "close small4fbox flaps": 110,
 "Move the yellow cloth to the bottom right of the stove top.": 19,
 "Move item from pot and place it on towel.": 35,
 "removed the maroon vegetable fro the pot": 50,
 "move the silver lid  to the top right of the burner": 37,
 "move the blue spatula on top right burner": 24,
 "Place the strawberry between the spatula and the metal pot.": 38,
 "Move the can to in front of the blue fork and against the brick wall.": 37,
 "move the yellow object below the left burner": 31,
 "put mushroom into silver pan": 48,
 "Place the spatula on the front left corner of the table": 28,
 "Pick up the pot and place it in front of the blue block": 39,
 "put the ring on cylinder": 44,
 "put the red objectin the pot on the left burner": 39,
 "The direction is from left": 43,
 "put the cube on top of the cylinder": 40,
 "remove the lid of the silver pot and put the lid on the stove": 36,
 "move the cloth from bottom to the top of the table": 46,
 "put the yellow object on top of the purple cloth": 31,
 "Move the mushroom off the cloth and into the pan.": 26,
 "Move yellow pepper from yellow cloth and put in silver pan": 35,
 "move the chess shaped to the left": 33,
 "put the yellow spoon on the silver pot": 42,
 "take the object out of the drawer and put it behind the drawer": 40,
 "pick up the cylinder in the middle of the table and put in on the rectangle": 46,
 "pick up blue pen and put into drawer": 132,
 "move the silver pot on the green napkin": 30,
 "Put the bowl near the blue rectangle and green food.": 38,
 "Move the vessel and place it just behind the knife": 46,
 "put cup into pot or pan": 100,
 "Place the silver pot on the back right of the table.": 46,
 "Take the rectangle block and put it on top the rectangle block with red mark": 40,
 "Place the red bell pepper inside the pan.": 28,
 "take the silver pot and put it on the green cloth": 32,
 "take pot lid located on lower left burner to place on top of silver pot on lower right burner": 26,
 "move yellow pepper from right to left table": 34,
 "put the bunny in the silver pot": 52,
 "the robotic arm did not move": 23,
 "they using a induction cooker so that they fasting cook": 53,
 "put plus in center of the table in front of red cube": 41,
 "move the red arch from the top of the blue rectangle": 46,
 "Place the pot on the yellow towel": 76,
 "close the pot and place on the upper left side of the table": 26,
 "move the silver pan to the right side of table": 37,
 "moved a cloth from bottom right to top left": 28,
 "put bread on plate and pear in pot or pan on stove": 130,
 "move the purple cloth to the lower left corner of the stove": 25,
 "close white1fbox flap": 110,
 "dsgf fdb  nfdbdf dbffgbngf gfnn nm": 37,
 "Place the capsicum on the left edge of the table.": 46,
 "put the blue object in the drawer": 38,
 "put the green thing on the right burner": 29,
 "Move the carrot from the pot.": 41,
 "put spatula on plate sink": 179,
 "Close the Drawer": 21,
 "holding spoon": 32,
 "move the silver pot  to upper right stove": 33,
 "put pan in sink": 136,
 "put spoon in bowl sink": 189,
 "topple hot sauce bottle cardboard fence": 180,
 "Remove the lid of the pot": 23,
 "move the towel near the silver pot onto the right side": 25,
 "touches the mouth of the orange bottle": 33,
 "Take the orange pot and put it on the upper part of the table.": 43,
 "put the tomatoes into the cloth": 41,
 "put cereal on plate and sweetpotato in pot or pan in sink": 76,
 "moved the lid from the pot onto the towel": 53,
 "put strawberry in pot or pan an put pot or pan on stove": 63,
 "Place the mushroom to the left of the yellow spoon": 23,
 "put big spoon from basket to tray": 147,
 "Place the banana inside the pot": 46,
 "move the green towel to the upper right of the table": 19,
 "Put the green arch ontop another arch": 44,
 "upright hot sauce bottle cardboard fence": 203,
 "move yellow knife from left side of the burner and put it on the right side": 42,
 "move the cloth in the right top of burner": 39,
 "moved the blue cloth to the right burner": 25,
 "put the green object on the top of the drawer": 29,
 "put the white object on the purple cloth": 46,
 "Move the purple towel to the front right corner of the table.": 29,
 "place the spatula on the top right corner of thee table": 29,
 "put the purple object in the silver pot to the left side on the red pot": 43,
 "fold the cloth from the the top left to  bottom right": 45,
 "Place the yellow knife to the right of the right burner": 24,
 "fold the cloth from the top right to bottom left": 35,
 "put the cube with a hole on top of the rectangular": 46,
 "put the green pear in the silver pot": 41,
 "move the red spoon below the yellow object": 38,
 "Move the yellow towel to the left of the blue fork.": 35,
 "put the blue fork on the right side of the silver strainer in the sink": 56,
 "move the pink rabbit to the middle bottom of the table": 42,
 "put the drumstick inside the silver pot": 56,
 "put pot or pan from sink into drying rack": 126,
 "Move the towel to the left side of the table in front of the knife.": 36,
 "move  the grey item to the edge of the table": 21,
 "moved the can to the top right side of right burner": 37,
 "put the lid on the pot": 35,
 "moved the cloth to the bottom left side of the table, besides the blue spoon": 18,
 "Move the yellow cloth on the table from bottom left to bottom right": 28,
 "Moved the can to the center of the table": 26,
 "move blue towel above yellow knife": 33,
 "Put the spatula above the cloth.": 46,
 "move a green object": 21,
 "Moved the pot to the middle lower of the burner": 36,
 "Put the egg inside the pot.": 37,
 "put the orange figure on the top edge of the cloth": 36,
 "place the long and thin wood on the top of of a wood block": 35,
 "put the tomato in the saucepan": 36,
 "moved the can to the left side of the table": 34,
 "Move the mushroom so it's on the blue cloth.": 18,
 "move the white object to the right side of the burner": 33,
 "Take the potato and place it into the stainless steel pot": 46,
 "put pan from stove to sink": 116,
 "move the fork to the top right of the bowl": 46,
 "put detergent from sink into drying rack": 101,
 "unfold the cloth from bottom left to top right": 317,
 "Move the knife in the top middle part of the yellow cloth": 23,
 "move square yellow block from the top of blue arch block and put it on the table": 26,
 "Move the yellow towel behind the colander": 29,
 "move the green cloth to the left of the table": 20,
 "pick up the brown rectangle and put down on the center table": 42,
 "can put on the bottom right part of the table": 37,
 "move the fork to the middle of the table": 39,
 "put the blue cloth on the bottom right of the table": 104,
 "move the orange cloth to the lower right of the burner.": 19,
 "fold the cloth from top right to bottom  left": 38,
 "Move mushroom to left of blue napkin.": 41,
 "Placed the spatula on the top left burner": 22,
 "move the ball from the cup to the circle": 39,
 "fold the cloth from top left to the middle": 67,
 "Move the pot in front of the cans": 28,
 "take banana out of colander": 192,
 "moved the can sideward": 48,
 "Move mushroom and place it on top of towel.": 26,
 "move light switch to the right": 103,
 "Put the broccoli on the yellow cloth.": 41,
 "move the thing to in the drawer": 32,
 "fold the cloth top right to bottom left": 34,
 "Fold cloth from bottom right to top left": 33,
 "move blue spoon to just below green towel": 46,
 "take the  towel from the basket and put in the table": 46,
 "move the blue cloth to the bottom right corner of the table": 38,
 "put photeto out side the drawer": 27,
 "put beet in pot sink": 164,
 "take the silver pot and move it to the bottom left burner": 29,
 "move the white block to the left side of the table.": 36,
 "take the arch and put it on top of the tower": 37,
 "moved the yellow cloth to the left bottom side burner": 22,
 "Put the pot above the napkin.": 26,
 "move the circular block from left to the right side of the arch": 34,
 "put the rectangular block on top of the blue rectangular block": 46,
 "move silver pot lid from top left of the the table to the right of the table": 32,
 "Move the blue cloth from near the tomato and place it in the left side of the table": 40,
 "Fold the cloth from top left to bottom right": 68,
 "moved the soup ladle to the left corner of the burner": 26,
 "pick orange toy from blue cloth and keep it on the vessel": 25,
 "put the orange cone beside the drawer": 34,
 "move the refresher to the left of the table": 31,
 "Fold the cloth from bottom right to top left": 114,
 "put the cube on top of the blue rectangle block": 46,
 "move the object to the middle bottom of the table": 27,
 "Place the yellow towel to the left of the blue fork": 43,
 "take a long thin block and put it on top of the shape to the left": 43,
 "put stuffedpig in pan": 117,
 "move the lid of the silver pot in the right side burner": 28,
 "Move the blue fork to the other side of the silver pan.": 92,
 "move the lid from the left lower cooker to the right upper cooker": 33,
 "fold the cloth from the bottom to the top": 221,
 "put the blue  object  to top left of the stove": 41,
 "moved the silver pot on the left burner beside of the yellow cloth and yellow lemon": 46,
 "move the yellow corn to the upper middle of the table": 21,
 "zip zipper bag": 124,
 "Place the knife below the silver pot.": 38,
 "move blue spoon to lower right corner": 40,
 "moved the blue fork to the bottom right side of the stove": 40,
 "move the orange pan to the left side of the stove": 34,
 "put the red object on the top of the yellow cloth": 46,
 "moving the object to the right side.": 47,
 "Pick up the napkin and put it above the spoon next to the black stove.": 35,
 "move the silver pot to the top left of the table": 25,
 "take sushi off plate": 181,
 "move the cloth from inside the bascket to the right side": 37,
 "Place the broccoli on the blue cloth.": 35,
 "Place the silver bowl on the orange cloth.": 32,
 "move the red cup from the sink and put on the left side of the sink": 46,
 "move the yellow duck to the bottom right of the table": 32,
 "Move spatula above pot, left of purple cloth.": 36,
 "removed the cup from the blue block and placed it on the table": 46,
 "move the strawberry on the upper left side of the table": 30,
 "fold the cloth de right to bottom left": 33,
 "fold the cloth from the bottom right to the top left": 71,
 "take the orange fork and put it on the lower left side of the burner": 53,
 "moved the blue scrubber onto the lower right burner": 32,
 "pick up blue towel from the grey thing and placed it to the right of the white basket": 46,
 "Place the red spoon to the left of the green towel": 41,
 "picked the blue object and put it on the silver pot": 31,
 "put the pot on the left burner": 42,
 "take the blue object and put it in the middle of the table": 46,
 "removes the green rectangular block on top of the yellow rectangular block and place it on the table": 34,
 "move the spatula in the pot to the bottom middle of the cooker": 46,
 "place green item inside silver bowl": 23,
 "moved the silver pot in the middle of the button burners": 40,
 "move the silver pot to the bottom side of the table": 28,
 "put banana in pot or pan": 129,
 "move the bread to the top of the table": 38,
 "move the silver pot from the top right burner to the top left burner": 34,
 "Move the pot to the right of the orange carrot.": 31,
 "move the orange object to the bottom left corner of the stove": 41,
 "remove the orange object from the pot and put it to the left burner": 27,
 "Move the silver pan to the front right corner of stove": 30,
 "put mushroom in pot or pan an put pot or pan on stove": 73,
 "MOVE THE BLENDER INSIDE THE VESSEL": 112,
 "put the yellow knife over the purple cloth": 26,
 "move a red folk to the bottom side of the left burner": 46,
 "moved the drumstick to the lower left of the stove": 32,
 "move blue brush from top to bottom diagonally on the left": 32,
 "fold the cloth from the right to the left": 64,
 "move the orange fish toy from the top of the drawer to": 26,
 "move the object from the bottom to the top": 43,
 "Place the blue cloth from the back of the table to the front": 36,
 "move the orange toy inside the right sink in the bin": 48,
 "put stuffedduck on plate and egg in pot or pan in sink": 146,
 "move the cloth to the right of the table": 24,
 "Move the bowl near the wall.": 27,
 "Move the mushroom and put in the pot": 21,
 "Moved the silver pot to the bottom right corner of the table": 30,
 "unfold the cloth from up to down": 33,
 "Move the yellow cloth to the top of the stove between the silver pot and a orange object": 31,
 "unfold cloth from the bottom left to the top right": 27,
 "fold the cloth from bottom roght to top left": 40,
 "Moved the silver pot from the middle of the sink to the right corner of the sink.": 39,
 "move the green pepper to the upper right side": 24,
 "put the green arch on top of the other green arch": 46,
 "move the blue rabbit in the left side of the table": 23,
 "move the spoon to the top right of the table": 44,
 "Move the green towel from the bottom right of the burner to the bottom left of the burner": 31,
 "moved the silver pot to the upper left side of table": 32,
 "put square on top of square": 45,
 "unfold cloth from the top left to the bottom right": 44,
 "put saltcontainer on plate and ketchupbottle in pot or pan in sink": 76,
 "Move the yellow cloth to the upper side of the stove": 29,
 "Unfold the clothes from the right to the left": 34,
 "move the cloth toward the center of the table": 22,
 "move a white object": 27,
 "Move the plate from the top towards the bottom right of the table.": 32,
 "pick up the cylinder from on top of the tower and place it on the table": 25,
 "put the egg in the drawer": 43,
 "Move cloth to left back of table.": 28,
 "move the bread to the right corner of the tip of the red fork": 23,
 "Place the pot between the mushroom and yellow spoon": 26,
 "Put the silver bowl on top of the purple cloth": 28,
 "RTGYR J?IU? KUU LKLIL HT TFHY N??.KJ J?K HTH HGH": 22,
 "Place the red object on the edge of the cloth": 25,
 "move the green cloth to the lower right side of the table": 30,
 "Pick up and drop up red covered spatula": 43,
 "move the can into the bottom part of the table": 23,
 "uncover the pot and put the lid on the left side of the cloth": 22,
 "put the bridge shape block to the bottom": 31,
 "move the blue spoon to upper right burner": 26,
 "moved the banana on the upper left of siuhi": 30,
 "put potato in pot or pan an put pot or pan on stove": 76,
 "moved a kitchen towel  an arranged from the upper part to the lower side of a thing": 31,
 "put pickle on plate and mushroom in pot or pan on stove": 152,
 "put brush into pot or pan": 119,
 "pick orange toy and place it near to the top of the vessel": 31,
 "unfold cloth from bottom right to top left": 116,
 "Move the violet cloth to the front edge.": 32,
 "Pick up the yellow cone and place it on the left of the green spatula": 29,
 "Moved the lid from the burner to the far end.": 32,
 "moving the yellow cloth on the table from left corner to middle": 46,
 "move the green cloth in the upper right of the table": 32,
 "Move the cheese slice in between pot and blue spoon": 41,
 "open the pot and put the lid on the burner of the stove  that is diagonally on the right side": 34,
 "moved the red spoon to the right side of the stove right beside the orange cloth": 36,
 "Place the cheese wedge to the left of the colander": 26,
 "pick up closest rainbow Allen key set": 24,
 "fold the cloth from the bottom left to the top right": 55,
 "moved the yellow green object and put it inside the silver pot": 35,
 "put the red object in the middle of the burner switches": 46,
 "Put the broccoli on the purple cloth": 29,
 "Put the pot on the napkin.": 29,
 "Take the white object and put it inside the plastic pot.": 50,
 "move the can to the middle left side of the table": 25,
 "déplacer la poêle sur l'autre bruleur à droite": 27,
 "put the red object to the top right of the cloth": 46,
 "deplacer la chose rouge entre les deux brûleur du bas": 36,
 "put the red arch on top of the yellow block": 46,
 "move the red object to the upper right corner of table": 27,
 "moved sushi to the bottom of the burner": 46,
 "moved the yellow cloth to the upper table part.": 49,
 "Slide the yellow cloth to the lower edge of the table": 23,
 "move the silver basket in the right burner": 26,
 "take the can and place it to the upper edge of the right burner": 31,
 "Move a yellow towel closer to a silver bowl.": 24,
 "put the blue brush to the left side burner": 31,
 "fold the cloth from top right to the left": 25,
 "put redcube in pan and put pan on stove": 196,
 "put the white block with a hole on the table": 30,
 "remove the blue block from the green block": 39,
 "Move the spoon to the left bottom corner of the table.": 43,
 "move stuffed animal into pot": 45,
 "Move yellow cloth to left of fork.": 42,
 "no movement": 7,
 "moved the knife to the left burner": 23,
 "move the strawberry to the silver pot": 26,
 "move the can to the top left of the table": 23,
 "unfold the cloth from the middle to bottom left": 75,
 "take the cylinder and put it in the block with space": 46,
 "move the blue block to right side of the table": 36,
 "the robot arm move the cover to the right": 46,
 "Put the bowl on the front left edge of the table": 34,
 "Pick up the red spoon and place it on the blue cloth": 32,
 "Move the spatula and place it on the green cloth.": 46,
 "move the blue spatula in the bottom of the table": 43,
 "move the red object from the edge to the top right.": 46,
 "take the bear out of the pot onto the middle of the table": 54,
 "put mushroom on plate and fry in pot or pan in sink": 76,
 "pick up the yellow pepper and put it on the lower stove on the right": 36,
 "Put mushroom in pot laying down, angled up and down.": 24,
 "Put the green pepper in front of the pot": 28,
 "move the green block to the top": 46,
 "put the red cup on the right burner": 56,
 "put the yellow triangle cube on the bottom left of the table": 36,
 "move the green cloth to the right lower side of the stove": 35,
 "put the blue block on the top edge of the cloth.": 36,
 "put the stick inside the hole of the square block": 46,
 "put cup from counter to sink": 231,
 "place blue spoon on the yellow cloth": 30,
 "move the yellow duck to the right side of the green spatula": 33,
 "move the blue cloth": 29,
 "Move the corn to the left side of the stove beside the spatula": 23,
 "place vessel on the blue cloth": 73,
 "Pick up the banana and place it on the left of the pot": 28,
 "put yellowpepper on plate and cookiebox in pot or pan on stove": 76,
 "Put the orange fish on top of the yellow cloth": 31,
 "Move the yellow cloth to the left side of the table": 23,
 "move the silver pot to the left side of table": 27,
 "Place the red spoon into the pot": 36,
 "move the yellow cloth to the bottom right of the stove": 25,
 "Move the can to the top of the table close to the green cloth.": 21,
 "move the yellow cloth on the left corner of the table": 28,
 "put the orange object in the silver pot": 92,
 "Picked the red cube from the table": 38,
 "tomo la cuchara amarilla, ponla en la parte inferior derecha de la mesa": 35,
 "move the yellow thing to the top right of the table": 37,
 "Take the pink bear out of the silver pot and put it in the switch of the burner": 43,
 "move the silver pot to the top left on the table": 28,
 "remove the food from the pot": 26,
 "end effector reaching stuffedrabbit": 48,
 "move the white object out of the pot": 21,
 "move the banana to the middle of the burners": 27,
 "Move the blue spoon to the lower middle of the table": 46,
 "put sweet potato in pan which is on stove": 104,
 "Move the pot from one side to other side of the table.": 46,
 "put pot or pan on stove and put fry in pot or pan": 146,
 "move the yellow cloth to the bottom left of table": 18,
 "move can from left corner to bottom left corner of the burner": 27,
 "Folded  the yellow": 37,
 "Put the red pepper inside the pan": 32,
 "move the white ball from the front to the left side of the drawer": 25,
 "Pick up the pot and place it on the left of the purple cloth": 46,
 "remove the can from the cloth and put it on the table": 39,
 "moved the butter knife from the silver pot to the plastic pink cup": 54,
 "unfold the cloth from top right to bottom leftt": 36,
 "Move the cloth to the far edge of the counter.": 29,
 "put the orange thing to the basin": 32,
 "Move the pan to the left edge of the stove top": 32,
 "Slide the bowl to in front of the spoon.": 44,
 "put the knife on top of the bottom left burner": 42,
 "move the green thing to the middle near between the right upper and lower burner": 26,
 "put spoon on plate": 78,
 "Move the orange bottle to the right side of the pot.": 30,
 "put the green rectangle on top of the yellow rectangle": 38,
 "Place the spoon on the left corner of the table.": 39,
 "put the yellow banana on the table from the top of the drawer": 33,
 "Place the knife onto the piece of cloth.": 41,
 "Put the L rectangle to the top of the tower.": 46,
 "moved the half carrot to the left side of the burner": 32,
 "move the yellow object to the top left side of the table": 29,
 "put the red arch  on top of the blue cube": 46,
 "covered the right halfway with a white cloth.": 37,
 "move the violet cloth besides the bread located in the middle of the table": 26,
 "moved the sushi roll to the middle top of the burner": 30,
 "move the blue cloth to the middle top of the table": 26,
 "Move the orange  cloth from right side to left side": 36,
 "move the yellow cloth to the bottom right corner of the table": 125,
 "move the orange cloth to the bottom middle of the stove": 22,
 "fold the cloth from bottom right to top left of burner": 34,
 "put pear on plate": 128,
 "put the red block on the yellow block": 45,
 "Place the pot in table to top right of orange cloth on the table.": 43,
 "Take the pot from the upper left corner and put it to the lower right corner of the tanle": 25,
 "pick red spoon and place it on the center": 42,
 "Place the spoon on top of the towel.": 46,
 "take the yellow object out of the silver pot and put it between the burner and  the sink": 38,
 "moved the silver pot to the lower left corner": 50,
 "Move the metal pot next to the blue cloth and near the front edge of the table.": 63,
 "put the circle block with a big hole behind the tower.": 44,
 "move the green arch to the left": 46,
 "unfold the cloth from the top left to the bottom right": 40,
 "unfold the cloth from bottom to top": 176,
 "Move the pot from corner to the edge of the table.": 38,
 "removing rectangle shape from the arch": 46,
 "move the yellow knife to the top middle part of the table": 35,
 "Move the can to the front left corner of the table.": 28,
 "move the cloth to the left": 8,
 "move the red arch on top of the yellow and blue cube": 46,
 "move the green cloth the bottom right side of the table": 22,
 "put to the croissant to the middle of the table": 31,
 "Move the metal pot so that it sits in the middle of the front edge of the table.": 25,
 "remove red object from drawer and move to bottom right of the table": 46,
 "Put the brush on the bottom left of the stove.": 26,
 "Place the strawberry just behind the vessel.": 42,
 "Move the pot near the microwave.": 37,
 "moved the silver pot to the bottom left of the table on top of a purple cloth.": 27,
 "Put the pan under the cloth.": 42,
 "Moved the silver pot from the bottom left cooker to the bottom right cooker": 25,
 "Put the green spoon beside the metal bowl.": 34,
 "Put the spoon on the orange cloth": 39,
 "Put the potato in the pot.": 79,
 "took the lid and put it on the pot": 35,
 "move the cloth from the bottom to the top left": 22,
 "move the yellow block at the right side and place at the top of another block": 43,
 "put the silver pot in the left burner": 26,
 "put stuffedcheeta on plate and sweetpotato in pot or pan on stove": 65,
 "taking the eggplant and drop it on the table": 20,
 "Move the top and the mushroom into the top left of the table": 46,
 "moved the green spoon to the right of the right burner": 45,
 "move the bowl to the towel": 29,
 "taken away the lid from the pot and placed it on the table": 25,
 "pick the white rectangle  block and put it on top of the other white rectangle block": 45,
 "move green object to the bottom right of the stove": 39,
 "Move the two blocks to the left side": 30,
 "unfold cloth from the top to bottom": 31,
 "put the yellow-handled knife on top of the silver bowl": 56,
 "put the stuffed toy inside the drawer": 28,
 "Pick the egg on the cup and put it on the table": 44,
 "move the blue brush beside the yellow object": 23,
 "put the lid above the pan": 43,
 "take the doll out of the box and put it in the left side of the table": 31,
 "move the violet towel to the lower right side of the burner": 23,
 "move the object to the upper right side of the table": 27,
 "put the yellow knife on the left side of the sink": 52,
 "move the yellow  cloth to the bottom left of the table": 43,
 "Move pot up, to left of orange cloth.": 46,
 "move the cloth to the centre of the table": 46,
 "Move the mushroom in front of the blue towel": 22,
 "put cheese on plate and sausage in pot or pan in sink": 73,
 "moved the cloth in between the two cans": 56,
 "Put the yellow brush on the left side of the table.": 34,
 "Move the scrubber to the right side.": 37,
 "moved the yellow kitchen rag to the upper right corner of table": 22,
 "put strawberry on plate and corncob in pot or pan on stove": 55,
 "place the red object inside the silver pot": 56,
 "move the blue item from left to right": 56,
 "Move the banana to behind the bowl": 33,
 "Put the mushroom on top of the blue cloth.": 33,
 "put the block with a hole on top of the white cube": 46,
 "moved the orange pot to the left middle of the table": 48,
 "move the orange cloth to the bottom left of the table": 29,
 "put corncob in pot or pan an put pot or pan on stove": 69,
 "Put the purple cloth to the left of the burner": 26,
 "Put the pepper above the red spoon": 41,
 "putting blue block between blue block and yellow rectangle": 36,
 "take out the cucumber in the silver pot and place it on the lower right side of the table": 32,
 "remove the rectangular block from the tower and place it on the right side of the table": 40,
 "Unfold cloth from bottom left to top right": 46,
 "Grab the thing and put it on top of the drawer": 20,
 "Place the bred behind the green cloth.": 42,
 "put the red fork inside the orange pot": 43,
 "Put the silver pan between the yellow brush and the pear.": 29,
 "Move the knife and place on blue towel": 31,
 "Put the napkin towards the bottom of the table in the middle.": 32,
 "fold the cloth from left to bottom right": 43,
 "move the red stuffed toy on the left side of the yellow banana": 27,
 "take the rectangle block off of the blue rectangular block and put it on top of the other block": 46,
 "Place the red utensil on the left corner of the green cloth.": 45,
 "unfold the cloth from  the right to the left": 27,
 "Put the drain cover in between the pan and the orange cloth": 46,
 "put the black and white object inside the silver pot": 23,
 "take the lid on top of the pot and put it on the top left of the table": 26,
 "put the pink toy to the upper corner left side of the table": 21,
 "close the drawer .": 27,
 "Move the mushroom to the top middle of the stove.": 24,
 "moved the red spoon to the button left burner": 27,
 "took the silver pot and put it on the upper right burner": 31,
 "move the cloth to the left of the table": 182,
 "put pot or pan on stove and put mushroom in pot or pan": 137,
 "end effector reaching stuffedhippo": 32,
 "moved the toy to the lower left side of the table": 20,
 "take the green arch off of the red arch and stack it on top of the other green arches": 46,
 "remove the red hexagonal cylinder from the cylinder and put it to the right": 35,
 "Place the spoon at the left of the green piece of cloth.": 46,
 "move the yellow object to the left burner": 33,
 "put the triangle block down to the desk": 46,
 "put the green block on top of the blue cube": 46,
 "moved the silver pot on top of the blue cloth": 69,
 "move the yellow cloth to the bottom left corner": 20,
 "pick up the potato and place it on top of the yellow cloth": 38,
 "push the can away from the silver pot and towards the left side of the table": 38,
 "pick up violet Allen key": 121,
 "right pepper shaker": 108,
 "took the block from left side of the table and put it on top of the tower": 41,
 "Move the tin just behind the spatula": 31,
 "Place the croissant on the yellow cloth.": 37,
 "Pick up mushroom on top of cloth, move it back towards cans.": 20,
 "Move the can to the right of the pot": 70,
 "mettre la figure rouge sur le bord du tissu": 34,
 "take out the green object from the silver pot and put it on the top right side of the stove": 33,
 "moved the can to the right side of the green clothing": 29,
 "put fry on plate and mushroom in pot or pan in sink": 76,
 "Pick up the silver pot and place it in between the purple towel and the microwave.": 29,
 "makes the pot on the orange clothe": 31,
 "move the cube from the tower on top of the yellow cube": 46,
 "Put the purple towel between the spoon and the metal pot.": 32,
 "move the red bell pepper to the middle lower part of the table.": 35,
 "put the purple cloth in the white basket": 26,
 "put one cube on top of another cube": 46,
 "Move the blue fork from the right side and place it on the left side of the pot": 46,
 "Put the spoon above the napkin.": 43,
 "Put the mushroom between the spoon and cloth": 29,
 "move pot to lower right corner": 26,
 "take the yellow knife and put it on the right burner": 46,
 "moved the green object to the top right side of the burner": 36,
 "move the basket to the center of the wooden table": 39,
 "put the cup to the top of cube": 46,
 "Move the red cube to the right of the tower": 42,
 "Move the fork to the left edge of the table": 35,
 "take the lid of the glass pot and cover the pot": 35,
 "put the blue spoon to the bottom left side of the stove": 33,
 "put sushi in pot or pan": 126,
 "Slide the orange cloth back toward the wall.": 24,
 "Move the lid to the center of the stove.": 37,
 "unfold the cloth from bottom right to top left of the table": 38,
 "pick up something from the black pot and put beside the sink": 54,
 "pick the cucumber and place it beside the toy": 30,
 "move the blue cube to the upper left corner": 37,
 "move the silver pot to the top center of the stove": 33,
 "move the spoon to the left bottom side of the table": 33,
 "move the red pepper in the center of the stove": 30,
 "Place the spoon on the blue cloth": 28,
 "Place blue spoon on the green cloth": 33,
 "fold the cloth bottom right to top left": 41,
 "put the white and brown thing into the silver pot.": 34,
 "move the violet cloth near to the vessel": 24,
 "Place corn in front of the spatula on the table.": 28,
 "Move the green cloth between the pot and the spatula.": 30,
 "Move the spatula to the bottom right of the pot.": 42,
 "Move the towel to bottom right of burner": 35,
 "take the cylinder off of the other cylinder and put it on the arch": 34,
 "put the triangle cube to the top": 46,
 "move the blue arch on the top of the cup": 46,
 "move the yellow object from the silver pot to the bottom left side of the burner": 24,
 "put the white object to the burner on the top right": 26,
 "Place the blue toy on the orange tray in front of the vessel": 30,
 "move the silver bowl from middle to left side, above the lid": 29,
 "unfold the cloth from the middle to the right": 31,
 "move the silver pot to the lower right side of the stove": 32,
 "Move the towel to the right of the fork.": 25,
 "Place  the bowl on top of the yellow towel": 37,
 "unfold the cloth before the middle to the bottom left": 44,
 "move the silver pot to left bottom burner": 33,
 "move the yellow with green checked vessel from front to back": 41,
 "pick up glue and put into drawer": 83,
 "place the white rectangle from the table to on top of the white rectangle": 46,
 "move the toy on top of the drawer": 27,
 "fold the cloth from top left to the bottom right": 29,
 "move red spoon to middle of stove": 35,
 "put the blueberries on the lower right side of the right burner": 30,
 "Place yellow towel at front edge of table": 30,
 "move the purple cloth to the top right corner of the stove": 25,
 "PICK UP THE VESSEL AND PUT NEAR THE WHITE TOWEL": 38,
 "Put the yellow cube next to the another yellow cube": 33,
 "move the silver pot to the top right corner of the table": 26,
 "move the yellow bell pepper and put it on the lower left burner": 28,
 "put the grey toy in the drawer": 45,
 "moves the cloth to the top right of the table": 19,
 "move the blue spoon to the left on the pan": 36,
 "fold the cloth": 31,
 "fold the cloth from the bottom left to center": 23,
 "put the cucumber on the right burner": 30,
 "put the blue triangle on top of the red arch": 46,
 "Place the metal pot in front of the space between the fork and the blue cloth, next to the front edge of the table.": 28,
 "Put the green object in the pot.": 29,
 "put blueberry on plate and spoon in pot or pan in sink": 76,
 "move the yellow object on the silver pan": 39,
 "Place the yellow pepper on top of the green cloth.": 35,
 "Put the cheese on the orange cloth": 39,
 "move the can beside the blue cloth": 33,
 "move the cloth to the bottom left of the stove": 33,
 "put the sushi in the drawer": 73,
 "move the cloth from bottom of the table to top of the table": 22,
 "Moves the black cloth next to the knife.": 38,
 "Place the orange brush directly above the silver bowl.": 37,
 "Place the metal pot on top of the yellow cloth.": 46,
 "put the white arch on the other arch": 42,
 "Move the can to the front left corner of the table": 44,
 "Move the towel to the front left corner of the table": 25,
 "Pick the green box from top of the cylinder and place it on the left side": 42,
 "picked up orange object and move to the top left of the cloth": 37,
 "Put the bowl on the near edge.": 35,
 "move the drumstick to the right front corner of the table": 35,
 "move the orange cloth right next to the spoon": 46,
 "move the silver pot to the top of the orange cloth": 25,
 "move fabric left to right": 20,
 "Remove the yellow cube from top of the cylinder and place it in the middle of the table": 42,
 "Move sushi roll to upper middle edge of the table.": 37,
 "Put the red tube onto the cloth.": 27,
 "move blue brush to left of chicken": 39,
 "move blue towel to lower right corner": 34,
 "put the spoon at the center of the counter": 46,
 "Place the yellow bottle to the left of the yellow towel": 40,
 "move corn to the red bucket on the right side of the burner": 53,
 "move the silver pot above the yellow brush": 60,
 "put the wooden brush left of the yellow towel": 26,
 "open the brown pot and put the lid to the  lower left side of the table": 35,
 "move the  red block to the top of secondred block": 46,
 "moved the red pot at the upper right corner of the sink": 56,
 "Move the pot in front of the potato.": 26,
 "Moved the yellow cube from the red block and placed it on the left of the table": 33,
 "put the banana on the upper right side of the table, above the ice cream cone": 35,
 "pick the carrot and put it in the silver pot": 29,
 "Place the cloth between the pot and mushroom": 28,
 "Put the rice ball into the pot": 34,
 "unfold the cloth from right to far right to straighten it": 34,
 "Move yellow cloth to the top-right corner": 43,
 "put the violet cloth on the left side of the table": 46,
 "unfold the cloth from the left to the right": 29,
 "move the green object to the lower right side of the table": 35,
 "Put the banana in the pot": 36,
 "move the towel to the top edge of the table": 20,
 "remove the silver plastic spatula from the yellow rack and put it on top of it in the sink": 42,
 "fold the cloth from bottom right to upper left": 36,
 "put cube on plate and smalltomato in pot or pan in sink": 71,
 "Move fork towards upper right corner of counter.": 46,
 "take the silver lid and put it on the top of the silver pot": 46,
 "move the blue rectangular block to the left side of the table.": 38,
 "put the red teaspoon in the orange pot": 52,
 "put the red arch on top of the yellow rectangle": 39,
 "remove the orange object from the drawer": 46,
 "Move the silver pot to the bottom left of the burner": 28,
 "move the the green cloth to the center of the left stove": 34,
 "moved the toy from the top of the drawer to the bottom right side of the table": 22,
 "put the yelow figure on the top edge of the cloth": 33,
 "Tomo  la  tapa  de  la  olla  y   la  deja   en  la  mesa": 33,
 "move the silver pot from the bottom right burner to the bottom left burner": 26,
 "Move the yellow cloth from edge to centre of the table.": 46,
 "Put the tomato in the pot": 30,
 "move the rectangular block": 46,
 "put the grapes in the silver pot": 31,
 "déplacez le bloc rectangulaire rouge au milieu de la table": 28,
 "Put the sushi in the bottom right hand corner of the table.": 41,
 "move the yellow fork to the top right of the table": 22,
 "put pumpkin on plate and chickenwing in pot or pan in sink": 76,
 "move the ladle to the upper right side of burner": 30,
 "move the red object to the lower left burner": 26,
 "put pan on stove and put stuffedpig in pan": 219,
 "Move the red bottle to the front of the counter.": 44,
 "move the thing from the upper right burner to the lower right burner": 30,
 "Move the squash in front of the blue fork.": 23,
 "put the green cloth in the basket": 68,
 "take off the pink rabbit from the drawer and place it on the center left side of the table": 29,
 "moved the silver pot to the center of the table above the plate": 47,
 "Move the blackberry into the pot": 25,
 "end effector reaching carrot": 32,
 "put the corn to the far left of the counter": 22,
 "Took the red block from the tower and placed it on the right side of the table": 39,
 "Put the red fork in the sink": 43,
 "Unfold the cloth from bottom right to the  top left": 38,
 "Move the purple towel in front of the pot": 31,
 "he does nothing but move": 24,
 "Move the piece of sushi out of the steel pan.": 46,
 "Place the banana behind the blue spoon": 39,
 "put the blue brush to the top of the blue towel": 37,
 "take the yellow object out from the drawer and put it in the right side of the drawer": 35,
 "Place the blue spoon in front of the red pepper": 42,
 "move the yellow brush next to the right burner": 35,
 "PICK UP THE VESSEL AND PUT ANOTHER SIDE OF THE TABLE": 75,
 "put apple on plate and stuffedlion in pot or pan on stove": 69,
 "move the mushroom to the front left table corner": 23,
 "move a doll to the upper part of the table": 31,
 "move the yellow capsicum to in between the left top and bottom burner": 46,
 "placed the yellow object inside the pot": 37,
 "Put the green cube on top of the red and blue cube": 46,
 "move the cloth to the left burner": 53,
 "Move the green peeler to the right of the red pepper": 44,
 "Put the pickle inside the bowl.": 31,
 "put the red strawberry in the drawer": 33,
 "move the yellow doll to the bottom right of the table": 31,
 "Move the spoon next to the metal pot.": 41,
 "Put the yellow knife below the silver pot": 30,
 "take the blue cube on the red block and placed it on the white arc": 46,
 "moved the blue fork in the upper left side of the burner": 32,
 "move the pawn to middle of the table": 37,
 "The robot moves the knife to the bottom middle of the table.": 44,
 "move pot to top right corner of table": 28,
 "Place squash inside of the pot.": 30,
 "Place the silver pot on top of the yellow rag.": 46,
 "Pick up the pot and place it on the far right edge of the table": 41,
 "Place the sushi inside the pot": 43,
 "take the apple out of the sink": 30,
 "picked up the silver pot lid and out it on top of the silver pot": 41,
 "move the pot from the left lower corner to the upper left corner of the stove.": 45,
 "put cucumber on plate and pear in pot or pan in sink": 76,
 "Moved the red spoon to the lower right side of the table": 28,
 "move the metal pot on top of towel": 25,
 "poner la lata roja con amarillo cerca de la lata verde": 25,
 "put cup on plate": 193,
 "Move the orange cloth to the far edge of the table": 36,
 "moved the lid to the bottom of the table": 26,
 "put the blue block on top of the yellow block": 45,
 "move the can to the top of the table": 22,
 "put the blue fork between the yellow knife and the blue cup": 39,
 "Move the mushroom to the left of the baster.": 27,
 "put yellow knife in silver pot": 42,
 "put the yellow duck  on the lower left side of the table": 22,
 "put the green cocumber inside the red bowl": 45,
 "put mushroom on plate and pickle in pot or pan on stove": 74,
 "moved the broccoli to the lower right side of the table": 31,
 "put the brown object into the pan": 41,
 "put the yellow object at the upper right side of the burner": 41,
 "folds the cloth from top to bottom": 35,
 "move the cloth from bottom to top": 27,
 "move the red object inside the silver dish": 43,
 "Move the spoon to the corner of the table.": 45,
 "unfold the cloth from the bottom left to top right": 33,
 "take out the cucumber from the drawer and put on the left side of the table": 38,
 "put chocolate on plate and apple in pot or pan on stove": 65,
 "Put the silver pot on the green rag.": 38,
 "flip orange pot upright in sink": 99,
 "move the can to the middle of the table": 38,
 "put the lid on the silver bowl": 33,
 "moove the silver pot to the upper right corner of the right burner": 36,
 "folded the cloth from top to bottom": 39,
 "move bowl to just below canned foods": 29,
 "put the pink teddy in the silver pot": 56,
 "move the cloth from the center of the table to the top left of the table": 21,
 "Put sushi rol on the left side of the stove": 45,
 "put the rectangle on top of the green arch": 46,
 "move the pot to the middle top of the table": 42,
 "move the brown pot to the top left side": 34,
 "place the strawberry on the yellow cloth.": 36,
 "Place the spatula in the center of the table": 41,
 "move the orange cloth to the left side": 29,
 "move the cloth to the back right corner of stove": 25,
 "move the can to the back of the table": 30,
 "Put the potato between the blue towel and the microwave": 30,
 "put the yellow block on top of the tower": 46,
 "Put the yellow figure on the right side of the cloth": 37,
 "move the cup in the right side": 36,
 "move the yellow rectangular block from top of the red arch and put it on the table": 46,
 "moved the white object to the bottom right corner of the green cloth": 35,
 "Move the sushi above the spatula.": 41,
 "move the silver pot below the right burner": 38,
 "move the white basket to the right side of the table": 99,
 "move the yellow knife to the left lower burner": 26,
 "Move the pot near left side of the yellow cloth in the table.": 33,
 "move the orange cloth near the white basket.": 27,
 "put the rectangle on top of the yellow block": 46,
 "Pick up the green spatula and place it behind the yellow cloth": 38,
 "put the blue laundry in the basket": 37,
 "put corn in bowl sink": 181,
 "took the wooden cup that was fallen and placed it upright on the table.": 33,
 "placing the pot on top of the right banner": 39,
 "moved the blue thing to the left": 39,
 "Place green pepper into pot.": 35,
 "Place the yellow thing on the burner": 34,
 "El brazo empujó la lata al lado izquierdo de la mesa": 25,
 "moved the green cloth to the upper center of the burners": 36,
 "move blue item to towel": 46,
 "Pick up the red object and place it on bottom right edge": 34,
 "Pick up the corn from the steel pan and place it on the table.": 30,
 "move the red cup away from the middle to top right corner": 53,
 "Pick up mushroom near table's edge and move right past blue cloth.": 29,
 "remove the green rectangle from the top of the yellow rectangle and put it on the table": 32,
 "move the green spatula to the upper left side of the table": 21,
 "put the blue brush on the right side of the green cloth": 33,
 "Move the blue fork to the bottom right corner of the stove": 44,
 "Place the silver bowl to the bottom left of the yellow vegetable.": 39,
 "Move the can to in front of the red spoon and up against the brick wall.": 43,
 "Move the blue spoon above the green cloth to the upper left side of the stove": 30,
 "Unfolds the cloth from top left corner": 43,
 "move a conserve to the right side of the table down": 28,
 "Move the spoon to the bottom right of counter.": 46,
 "Moved the blue spoon to the left of the table": 35,
 "takes the blue spoon and puts it next to the yellow cloth": 29,
 "move the can in the middle of the table": 22,
 "put the red bell pepper on top of the drawer": 53,
 "cover the silver pot with the silver lid": 54,
 "take the cylinder from the cylindrical hole and put it on the table": 33,
 "move white cylinder on the white rectangle": 46,
 "Move the blue utensil to the lower bottom right of the table": 41,
 "Move the mushroom out of the pot and to the bottom right table": 35,
 "put the green object to the pot": 36,
 "Move pepper from back onto yellow towel.": 46,
 "move red utensil to left side of bowl": 43,
 "move the thing to the right of the drawer": 28,
 "move the orange pot below the left side burner": 31,
 "move thje red fork to the  top side of the silver pot": 35,
 "cover the silver pot on the bottom right burner with the silver pot lid": 36,
 "move the basin to the left side of the stove": 35,
 "placed the red fork between the yellow can and the blue cloth": 21,
 "take the red object and put inside the drawer": 42,
 "Removing the item away from the cloth from the top right": 46,
 "it has removed  off the block and put it on the left side": 25,
 "put the sushi into the sliver pot": 31,
 "pick up the silver lid and put it on top of the silver pot": 60,
 "take the  steel cover and put it over the pot": 51,
 "unfold the cloth from the center": 26,
 "move the purple cloth to the bottom right of the table": 19,
 "move the clothe from the right to bottom right": 33,
 "Put the red capsicum in the pot": 32,
 "fold the cloth from the top to the bottom": 31,
 "Place the pan on top of the yellow napkin.": 27,
 "move the green object to the left burner": 33,
 "Take the egg and put it on the purple towel": 46,
 "Place the container in the pan": 42,
 "Take the bowl and put it to the right of the blue cloth": 31,
 "move the blue spoon on top of the rightburner switch": 42,
 "pick up the banana from the table and place it on top of the drawer": 27,
 "moved the silver pot to the middle switch of the burner.": 21,
 "Put the pot close to the microwave.": 30,
 "Place the colander on the front right corner of the table": 41,
 "move the blue elephant to the right side of the stove": 32,
 "move the silver pot lid to the upper right of table": 35,
 "move a yellow cloth in table": 47,
 "Move the sushi to the bottom side of the right burner": 46,
 "put the white arch on top of the green arch": 46,
 "Put the green spatula on the right side of the purple cloth": 28,
 "move the silver pot to the left edge of the table": 59,
 "Move the pan to back edge of the table": 41,
 "put the long cylinder on top of the cylinder": 46,
 "moved the blue cube that was on the table to the top of the cylinder": 40,
 "fold the clothe from bottom left to top right": 34,
 "Put the purple food on the left hand side of the stove.": 32,
 "put the orange lid to the orange pot": 35,
 "unfold the cloth from the center to left": 36,
 "move the yellow block to the center of the table": 46,
 "Place the object onto the table.": 33,
 "bring the orange to the front edge from back": 39,
 "moving the spoon on top of the sponge.": 39,
 "moved the blue spatula to bottom of the table": 43,
 "Place the corn next to the spatula in edge the table.": 42,
 "take the red object  and put it between the silver pot and silver lid": 26,
 "the arm open this table": 27,
 "unfold cloths": 46,
 "picked the blue thing and put it on the right side of the burner": 28,
 "Moves pot from bottom left corner to bottom right corner": 26,
 "Put the mushroom shape on the blue cloth.": 42,
 "Move the saucepan from orange towel to the middle edge of table": 27,
 "move the orange cloth to the right of the left burner": 21,
 "Drop the mushroom on the blue towel.": 20,
 "Move the knife to the bottom left of the table next to the silver pot": 56,
 "move the silver saucepan to the bottom left corner of the table": 35,
 "Put the duck inside the drawer": 24,
 "fold the cloth from the bottom right to the middle": 30,
 "unfold the cloth from left to right on table": 35,
 "fold the cloth top left to bottom right": 90,
 "Move the red cloth behind the pot with the carrot": 40,
 "take the monkey from the top of the drawer and put it on the table": 22,
 "robot folded bottom left to top right": 39,
 "move the silver pot to the upper left part of the stove": 41,
 "moved the green can to the right side of the table": 47,
 "move the yellow wiping cloth on the right side of the stove": 38,
 "put the rectangular block with drawing on top of another block": 39,
 "Remove the blue clothe from the left cooker.": 32,
 "Place the spatula on the front edge of the table": 69,
 "Move the spoon near to the pan.": 46,
 "pick up the yellow corn and place it on the bottom left burner on the stovetop": 44,
 "put the sliced carrot outside the drawer": 27,
 "take can out of pan": 26,
 "put the silver lid on the silver pot": 33,
 "place the egg on top of the purple towel": 27,
 "put the black ball in the drawer": 37,
 "Place the metal pot on top of the purple towel.": 33,
 "put fry in pot or pan an put pot or pan on stove": 73,
 "Put the orange object inside the basket": 42,
 "put apple on plate and crossaint in pot or pan on stove": 76,
 "Put the plus on top of the yellow rectangle on the tower": 46,
 "put the thing in the drawer": 24,
 "Move the mushroom to the right of the blue towel.": 30,
 "Place the blue brush behind the purple towel": 32,
 "move the silver pot to the left burner": 66,
 "unfold cloth from bottom left to the top": 34,
 "moove the silver pot to the top of the burner": 25,
 "puts the silver pot at the lower left of the table": 29,
 "Move the pot to the front left of the table.": 42,
 "put the lid on silver pot": 39,
 "Move the pot from the left burner to the side": 40,
 "cover the metal pot": 38,
 "open the silver pot and move the cover on the grey cloth": 29,
 "take the green block and put top of red block": 46,
 "move the  red object from the table to the top of the drawer": 23,
 "moved the orange object to the top left corner of the table": 29,
 "Move the brush and place it at the edge of the center of the table.": 46,
 "Put broccoli into pot.": 30,
 "move the light blue cloth beside of the red fork": 44,
 "move the red block from the top of the green arch and move it next to the blue block": 34,
 "fold the cloth from top right to the middle": 36,
 "put the arch on top of the blue block": 46,
 "move the cone from the middle of the table to the lower side of the table": 46,
 "Put the eggplant on the left side of the red spatula": 44,
 "Take a banana out of the drawer": 35,
 "Move the silver bowl to the top corner of the blue cloth": 42,
 "put the cube with on top of the cylinder": 36,
 "put the blue rectangle in to of the yellow rectangle": 43,
 "Pick up towel and place it right next to the canned goods.": 25,
 "fold the fabric over the machine": 39,
 "move the spatula to the right side of the stove": 26,
 "pick up box cutter and put into drawer": 144,
 "Place the blue spoon to the left of the green towel": 30,
 "open wooden drawer": 44,
 "move the can to the left side of the table": 29,
 "put egg on plate and stuffedduck in pot or pan on stove": 58,
 "Pick up the cloth and hang it in the air above the pot.": 46,
 "put the silver pot in the sink": 55,
 "folded the cloth from top to bottom left": 28,
 "move the green block to above on the table.": 31,
 "move the blue cloth in lower right of the table": 32,
 "put the blue knife in the pan": 43,
 "Nothing": 59,
 "unclothe from botton right to left": 24,
 "Put the napkin in between the spoon and the bowl but slightly above them.": 25,
 "move the silver pot to the bottom-right burner": 32,
 "Moved The wooden spatula to the left burners": 56,
 "Put the spoon under the cloth.": 46,
 "Pick up the silver pot and place it on the blue towel.": 34,
 "putting the spoon on the lefside of the burner": 26,
 "moved the chicken leg in the left side of the burner": 46,
 "put the red object in the drawer.": 45,
 "Pick up the pot and place it at the back of the table in the middle": 35,
 "Place the blue cloth to the left of the metal pot.": 35,
 "move the ladle from bucket to the right side of the sink.": 49,
 "take the fried egg from inside the silver pot and move it to the bottom right of the stove": 25,
 "Put the silver lid on the orange cloth": 32,
 "put the bear in the drawer": 27,
 "Move the green towel behind the pot": 35,
 "take the yellow knife and put it on the bottom left of the stove": 44,
 "move the cloth to the left of the stove": 46,
 "move the silver container to the left bin": 54,
 "Moved the brown doll above the blue toy": 21,
 "put the green arch on top of the red arch": 41,
 "Place the egg to the front right of the table with the red spoon in front and to the left of it.": 46,
 "Obedeceu ao comando": 28,
 "Move the blue cloth from downward to upward direction": 32,
 "move the blue cloth in front of table": 32,
 "move the silver pot on the lower left side of the stove": 38,
 "moved the silver pot to the right side of the pink cup": 50,
 "move the pot to the upper right": 29,
 "moved the silver pot to the bottom right corner of the table": 35,
 "Put the orange and white object on the cloth.": 39,
 "opened drawer": 41,
 "unfolded the cloth from right to left": 34,
 "move the yellow box in to the yellow pot.": 31,
 "moved the white basket in front of the washing machine": 33,
 "unfold the cloth from the top right to bottom left": 34,
 "Take the green object and put it on the lower right part of the table": 39,
 "Slide the towel down to the bottom of the counter.": 46,
 "move the silver pot to the bottom left burner": 81,
 "move the blue cloth to the upper right side of the table": 30,
 "put the yellow banana on top of the bottom left burner": 33,
 "fold the cloth left to right.": 42,
 "Hold the tea pan from left side of the table and place it on top of the green cloth.": 41,
 "put the yellow object on the purple cloth": 23,
 "place the silver pot on the yellow napkin": 44,
 "Move the pot to the bottom right of counter.": 36,
 "put the silver cover on the top left burner": 40,
 "Place the silver bowl to the right of the green cloth.": 36,
 "Place the potato inside the bowl.": 31,
 "remove the red figure from top of left edge cloth": 30,
 "move the yellow cloth to the upper right side of the right burner": 25,
 "Move silver pot to front right corner of stove top": 23,
 "pick rectangle block and place it on top of another block": 44,
 "take the bite-size mango from the pot and put it between the two left burners": 38,
 "PICK UP THE BLENDER AND PUT ANOTHER SIDE OF THE TABLE": 33,
 "Don't move anything.": 20,
 "Move the pot from the towel and place to the right of it": 30,
 "MOVE THE KNIFE WITH BLUE HANDLE FROM BOTTOM OF THE BLUE TOWEL INTO THE SILVER POT.": 51,
 "put the red rectangle on to the top of the yellow rectangle.": 40,
 "Put the red object inside the drawer.": 46,
 "move the light green cloth right next to the blue handle spoon": 17,
 "move the basket to the left side of the table": 34,
 "moved rectangular block from the table to on the L-shaped block": 46,
 "unfold the cloth to the bottom left": 46,
 "Place the knife on the right edge of the table.": 39,
 "PICK UP THESPOON AND PUT ANOTHER SIDE OF THE TABLE": 35,
 "move the pot to the right burner": 49,
 "pushed the can in-between the silver pot and the lid": 39,
 "move the cloth from left to right of table": 24,
 "move the silver pot to the upper center side of the table": 22,
 "change the position of the yellow thing from vertical to horizontal": 56,
 "Pick green cloth and put in the basket": 34,
 "Move the pot in front of the mushroom": 35,
 "move the red fork to the upper right of burner": 46,
 "Clean the object": 46,
 "fold the cloth from the left to the right": 63,
 "move the green toy to the left side of the table": 26,
 "Pick the spoon and keep the corner to the table.": 35,
 "put the red block in green rectangle": 46,
 "put the banana in the pot": 37,
 "Move the metallic pan from the burner": 39,
 "move the white toy on the middle of the burner": 31,
 "take the object in the barket": 32,
 "opened the closed drawer": 25,
 "Place the metal pot to the left of the green cloth.": 21,
 "take the silver pot and put on bottom left side of the table": 27,
 "put the light green towel in the basket": 38,
 "move red ball diagonally from top to bottom": 39,
 "Put the cloth in the middle of the stove.": 21,
 "move the red spoon to the top of the sink": 56,
 "move the silver pot to the right side": 40,
 "PICK UP THE SPOON AND PUT ON THE ANOTHER SIDE OF THE TABLE": 35,
 "put the corn on the left burner": 35,
 "put the silver lid to the left side of the silver pot": 35,
 "move the silver pot above the stove": 29,
 "move the banana to the left of the pot": 36,
 "remove the yellow cube from the blue one and put it on top of the green cube": 44,
 "move the can from the right to the bottom right corner of the table": 39,
 "unfold the cloth from the bottom left to the top right": 64,
 "put the cream king in the middle of the  two cubes with a hole": 46,
 "pick up the eggplant and place it on top of the drawer": 39,
 "move the silver pot and put it into the lower rightside": 25,
 "put the cylinder on top of the yellow rectangular block": 46,
 "Place the yellow cloth behind the vessel.": 35,
 "moved the yellow banana from the white towel onto the table": 25,
 "fold cloth from bottom left to top right": 37,
 "Place the bowl to the left of the napkin towards the upper corner of the table.": 35,
 "Removed  the cube from up to down": 46,
 "move the green spatula to the left upper side of the table": 47,
 "move the orange cloth below of the blue spatula": 26,
 "move the purple cloth to the bottom middle part of the table": 28,
 "Put the green handled spatula at the table's left edge.": 44,
 "put brush to the left of the pan": 26,
 "Put the mushroom shape directly in front of the toy microwave.": 29,
 "Move the steel pot from above the blue cloth and place it infront of the oven.": 29,
 "unfold the cloth to bottom right of the table": 33,
 "moved the cloth to the upper side of the brush": 18,
 "put tomato on plate and redpepper in pot or pan in sink": 144,
 "move the red cube from top of the tower and put it on the table": 35,
 "move the silver pot to the upper right side of sink": 28,
 "move drying rack out of sink": 83,
 "move can of corn to the left side of table": 24,
 "put the white pawn on top of the tall white cylinder": 43,
 "fold the cloth from the bottom right to top left": 65,
 "the robor arm cover the silver pot": 38,
 "move yellow and blue checked box from top to bottom": 40,
 "(These pictures aren't working)": 80,
 "fold the cloth from bottom left to the top right": 42,
 "pick the monkey and put it in the drawer": 37,
 "take the red object and put it on the right side  burner": 35,
 "pick the red spoon and put it on the right stove": 36,
 "put a blue triangle block on top of tower": 46,
 "take out the yellow duck and put in the left side of the table": 23,
 "puts the yellow cube on top of the cream cuboid": 46,
 "Move orange towel to left of blue fork": 39,
 "Move the Orange cloth towards the top of the table": 19,
 "Pick up the red fork and place it on the green cloth": 46,
 "Cierra el cajón de madera": 33,
 "move somethin": 24,
 "take the brown chocolate out of the drawer and put it on the table": 38,
 "Put the mushroom on the blue towel": 21,
 "take the smal cylinder on top of the bigger cylinder": 46,
 "move vessel on the right": 46,
 "Place the red pepper on the green cloth.": 26,
 "move the can on the top right of the table": 38,
 "Move the corn to the bottom middle of the table": 25,
 "Put the pan on the cloth.": 46,
 "Move the fork and place on purple towel": 30,
 "takes the object out of the drawer and leaves it on the table": 46,
 "move arch from top to bottom of the table": 45,
 "take the yellow banana from the drawer tp the middle of the table": 40,
 "Place the pot on to the table.": 30,
 "Put the spoon on the dish towel": 46,
 "Put eggplant into pot.": 24,
 "Pick up the pot and move on top of the towel": 33,
 "put the blue object in front of the drawer": 34,
 "Move the green napkin to the right corner of the table.": 34,
 "the red handkerchief is put in the plastic basket": 40,
 "Place the blue cloth in front of the microwave.": 24,
 "Move red item and place it inside of pot.": 28,
 "put the wood in the middle of the table": 45,
 "moved the stuffed giraffe to another side of the table": 23,
 "put the cup on top of the cylinder": 24,
 "push the can towards the right side of the burner and then back to the left side of the burner": 30,
 "Put the broccoli in the pot.": 29,
 "Put the vegetable in the pan.": 26,
 "places a silver pot between the two burners": 30,
 "move the blue fork to the top right of the stove": 37,
 "Move the silver pot to the top left of the stove top.": 30,
 "took the lid off of the silver pot and placed it on the bottom right of table": 57,
 "moved the orange cloth to the top right side of the burner": 36,
 "take the circle yellow object and put it inside the drawer.": 32,
 "move the blue towel to the bottom mid part of the table": 28,
 "MOVE THE BLUE FORK TO THE LOWER LEFT OF THE TABLE": 38,
 "take the plastic mushroom from the pot and put it between the burners": 35,
 "take the pot and put it to the bottom right of the burner": 28,
 "Put the bowl on the blue rectangle.": 42,
 "fold the cloth from bottom right to left": 78,
 "Move the pot to be directly in front of cans": 28,
 "move vessel to the bottom of the table from top to bottom": 46,
 "Put the grapes under the green cloth on the edge": 46,
 "Place the blue spoon behind the blue towel": 36,
 "mover la olla de plata al centro inferior de la mesa": 23,
 "Place the spoon on top of the pot.": 41,
 "put the cooking pot on the botom right burner": 46,
 "open a drawer": 54,
 "move the white basket in the middle of the table": 31,
 "Take the orange brush and put it on the top left corner of the table": 21,
 "Pick the  green cloth and place it on corner of the table": 35,
 "move the cucumber to the top right side of the table": 29,
 "put the red object on the bottom left of the table": 27,
 "move the square block with hole to the top left side of the table": 42,
 "move the blue spoon to the lower middle left corner of the table beside the yellow cloth": 56,
 "Move the red fruit slightly behind and to the left of the silver pot.": 23,
 "fold the cloth from top left to bottom right centre": 45,
 "moved the yellow thing from right burner to the left burner": 21,
 "Lift the silver pot and then placed it back on its normal position": 54,
 "Put the blue object on the left side of the green and yellow object.": 31,
 "move the green cloth on the upper side of right": 23,
 "move the red bell pepper to the left side of the table": 23,
 "move the purple can to the bottom center of the table": 28,
 "move the item from the left burner of the center": 23,
 "put the silver lid on the bottom right corner of the blue cloth": 56,
 "Move the orange cloth to the side of the counter": 46,
 "put the red rectangular on the top of the blue rectangular": 46,
 "Put the brush on the yellow cloth.": 26,
 "Move the mushroom and drop it in the pot": 23,
 "Put the green thing in the drawer": 18,
 "move the cucumber to the bottom right of the table": 43,
 "isrtfvmri0to,": 30,
 "put the yellow bottle in the silver pot": 21,
 "Move the blue plastic spoon on the upper left corner of the burner": 34,
 "Move the pot and put on the peeler": 46,
 "move the white basket to the right side of the washer": 32,
 "put smallpear on plate and fry in pot or pan on stove": 68,
 "move the orange cloth to the left side of the table": 32,
 "take the lid of the silver pot and move it to the right side of the table": 37,
 "twist knob start vertical clockwise90": 42,
 "Slide the cloth diagonally to the front of the spoon": 29,
 "Pick the spoon from corner and put it on the table.": 46,
 "déplacez le bloc rectangulaire bleu vers la gauche du table": 44,
 "unfold the cloth from the bottom right to the top left": 157,
 "moved the silver pot to the top left corner of the yellow cloth": 32,
 "put the red cube on top of the blue cube": 78,
 "take the sushi from the drawer and put it in the table.": 33,
 "Place the spatula on the far left edge of the table": 40,
 "moved the purple towel to the lower left side of the table": 27,
 "move the orange cloth beside the can in the center of the table": 31,
 "push drawer back in": 31,
 "unfold cloth from top right to bottom left": 69,
 "Place the potato on top of the green towel": 38,
 "moved a white object from table to the floor": 37,
 "put a blue cloth on a basin": 39,
 "put the blue figure on the right of the cloth": 30,
 "unfold the cloth from the bottom to the top": 46,
 "moved the blue fork from the top left burner to the bottom left burner": 29,
 "moves the towel from left to right": 28,
 "fold the top left fabric to the bottom left of the burner": 33,
 "Place the metal bowl in front of the yellow cloth.": 30,
 "Move the pot to the front right corner of the table": 34,
 "move the silver lid to the bottom left of the stove": 34,
 "moved the yellow cloth on the two burners": 44,
 "Move the blue spoon next to green cloth to under the right burner": 26,
 "move the orange cloth to the right": 24,
 "Bring the yellow cloth to the front edge of the table.": 32,
 "Pick up and move the white item on top of the cloth": 26,
 "fold the cloth from bottom right to center": 46,
 "Move spoon to left of pot.": 25,
 "Set the fork onto the green cloth.": 30,
 "take the brown object and put it on the green cloth": 21,
 "move the spatula behind the leg piece": 46,
 "move the lid to the lower left of the table": 26,
 "Move the orange towel to the right of the blue spoon": 35,
 "PICK UP THE VESSEL KEEP NEAR TO THE YELLOW TOWEL": 39,
 "pick up the red fork and place it on the blue cloth": 46,
 "take the yellow object out from the drawer and put it on the right side of the brown object": 39,
 "Move the red bottle next to the top point of the banana": 46,
 "moved the orange pot to the lower right of the table.": 38,
 "take the lid and covered it to the silver pot": 30,
 "move the red object": 46,
 "moved the cloth from the bottom right of the table to the top right of the table": 22,
 "moved the red carrot from the sink to the red basket": 52,
 "moved the potato on the upper left side of the table": 33,
 "Moved the orange pot to the lower left corner of the burner.": 45,
 "put the blue plush into the drawer": 36,
 "take the red spoon and put between the two burners": 26,
 "Move the red arch in the middle of the table": 46,
 "move the red towel to upper left of cooktop": 16,
 "put the blue triangle on top of white block": 46,
 "getting the blue object out of the drawer": 46,
 "Put the red object in the middle downside of the table": 40,
 "unfold the cloth from center to bottom right": 36,
 "take the metal pot and put it on the bottom left burner": 28,
 "move the silver pot to the burner on the left": 48,
 "move red spoon to the left burner": 30,
 "Put the spatula on the towel.": 40,
 "fold the cloth from the top left to bottom right": 28,
 "Place the pot on the upper right burner": 35,
 "move the green cloth from left to the rigth burner.": 33,
 "Move the silver pot to the left side of the orange towel.": 25,
 "pick green ball from vessel and put it outside": 35,
 "moved the white basket from the blue cloth": 36,
 "moved the can away from blue cloth to the upper side of the table": 35,
 "put a pot on the burner": 27,
 "move the cloth from right to left": 78,
 "put the blue spoon in the bottom right of the burner": 28,
 "take the rectangular object off of the tower and put it on the upper middle side of the table": 30,
 "Move the blue towel between the spoon and pot": 27,
 "moove the silver pot to the lower corner of the right burner": 31,
 "Move the white can below the right burner.": 38,
 "move the blue fork to the bottom middle side of the table": 46,
 "put the potato on top of the blue cloth": 28,
 "move the silver pot to the bottom right corner of the stove": 38,
 "Place the silver pot slightly below and in between the red vegetable and blue cloth.": 45,
 "remove the blue triangle between the  yellow triangle and  white cylinder and put on top of the red block": 46,
 "move the silver object on the right side": 35,
 "move the corn to the bottom right side of the table": 29,
 "Place the red fork between the pot and green towel": 45,
 "take the sushi from the orange towel and put to the silver pot": 38,
 "Place the blue spoon to the right of the green cloth.": 43,
 "Place the purple towel in front of the metal pot and next to the front edge of the table.": 30,
 "pick up cube off of the yellow block and move it to the front of the table": 46,
 "unfold the cloth from the left to thetop right": 39,
 "move the cloth from the bottom to top": 25,
 "put the strawberry into the cloth": 37,
 "Place the mushroom in the silver pan.": 20,
 "put fry on plate and smallpear in pot or pan on stove": 70,
 "Pick up the blue fork and place it where it was": 46,
 "mettre  le tissu au milieu de la table": 39,
 "fold the cloth from top left to bottom right and from bottom left to top right": 38,
 "take the stuffed animal from the drawer and put it on the left side of the table": 46,
 "Move the purple towel to the right of the red spoon": 23,
 "fold the cloth from bottom to top right": 46,
 "move the blue spatula to the lower left side of the right burner": 39,
 "move the object to the middle left of the table": 33,
 "placed the yellow block on top of the arch": 46,
 "put pot or pan on stove and put cheese in pot or pan": 76,
 "Place the blue cloth against the bottom of the mushroom stalk": 26,
 "Move the blue fork to the back left of the table near the wall.": 46,
 "pick cup cake and drop it on the vessel": 46,
 "move the blue brush to the top/upper left of the stove": 43,
 "put the silver pot above the blue cloth": 20,
 "move the orange doll in front of the drawer": 24,
 "move yhe sushi to the top left burner": 28,
 "remove the cylinder on top of yellow cube and put it on top of blue cube": 38,
 "put crossaint on plate and bread in pot or pan in sink": 58,
 "Push the yellow cloth to the left of the red spoon": 41,
 "Move the blue object near silver pot.": 46,
 "move the silver pan to the lower left corner of the stove": 45,
 "put the cyllinder on top of the plus": 46,
 "Pick up the strawberry and put it in the pot": 29,
 "move the cloth from bottom left to top right": 17,
 "move the plush toy to the lower left side of the table": 23,
 "put the yellow cube on top of the red arch": 46,
 "put the yellow knife on top of the yellow cloth": 39,
 "Move the red cube to the center of the table": 33,
 "get the blue pork and put in the upper left side of the stove": 27,
 "move the yellow cloth to the upper left side of the table": 34,
 "put the  figure orange the top edge of the cloth": 38,
 "move the yellow object into the silver pot": 26,
 "Move the panda to the right burner": 53,
 "moved the blue cloth to the upper left burner": 30,
 "fold the cloth form bottom right to top left": 45,
 "move spatula onto towel": 33,
 "Move the mushroom to the lower left of the table.": 25,
 "Move the opened can to the left of the desk.": 19,
 "Place the colander on top of the green towel": 45,
 "Place the sushi onto the purple piece of cloth": 40,
 "move the red fork to the right side of the stove": 48,
 "remove the orange fish from the silver pot and place it on the center left side of the table": 34,
 "Remove block from the tower and put on the left side of the table": 40,
 "put the object in to the pot": 34,
 "move a red folk to the top right burner": 24,
 "move the purple cloth to the left side of the table": 29,
 "unfold the object from bottom to down right": 36,
 "push the pot to the left": 30,
 "Place the green towel to the right of the red pot": 34,
 "Place the pot on the green cloth.": 31,
 "bring the green cloth to the front edge of the table": 35,
 "Pick up the green spatula and place it on the back corner of the counter": 34,
 "take the green object out of the pot and put it on the left out of the burner": 38,
 "move the cube to the left side of the table": 33,
 "put the orange object between the silver pan and the tomato can": 26,
 "Place the blue utensil on the orange towel.": 33,
 "move the red object to the right burner": 36,
 "PICK UP THE FISH AND PUT ON ANOTHER SIDE OF THE TABLE": 32,
 "takes the pot and puts it on top of the blue cloth": 36,
 "spread the cloth": 84,
 "Move the purple cloth from right side to left side": 41,
 "move the can to the right side of the table": 38,
 "move the white cube to the middle of the table": 37,
 "move the orange kitchen sponge to the top right of the table": 37,
 "put the green triangle on top of the plus": 44,
 "move the yellow knife to the upper right side of the stove": 35,
 "Move the blue cloth place it the edge of the table": 46,
 "moving a blue object to the right side of the banner": 42,
 "moved the red spoon in the lower right of the table": 21,
 "pick and move a yellow item to basket in right side of cooker": 50,
 "Move the pan from the left edge to right of the table": 41,
 "unfold the cloth from top to the bottom": 28,
 "picking and puting  the green block  under the other blocks": 46,
 "put a lid on the brown container": 42,
 "Put the pepper on the cloth.": 34,
 "put the other rectangular with a red sign on the top of the other one": 34,
 "Move the pot between the towel and the cans": 26,
 "unfolding the cloth from left to right": 20,
 "Put the rabbit into the drawer": 35,
 "moved the blue towel to the right.": 22,
 "move the yellow towel beside in the blue fork": 29,
 "Put the red handled spoon in the lower left corner of table.": 32,
 "place the white arc between the white arc and the brown solid": 38,
 "Move the can straight back on the counter next to the pan": 28,
 "put the sushi in between the pot and the lid": 24,
 "move the yellow object above the right burner.": 33,
 "move the orange pot to the right side of the table": 33,
 "Move the utensil and place it on the center of the table.": 46,
 "move the blue spoon to it to bottom left side of the table": 40,
 "move the grapes to the right edge of the table": 46,
 "remove the cylinder from the arch .": 22,
 "put crackerbox on plate and spatula in pot or pan on stove": 57,
 "put the plus  on the blue block": 46,
 "move the blue brush to the right side of the right burner": 33,
 "move the orange cloth to the bottom center": 34,
 "moved the blue knife to the bottom right end cooker": 46,
 "move the green thing to the bottom center of the table": 30,
 "unfold the cloth from the bottom": 42,
 "Grab the green fabric and put it into the washing machine": 37,
 "Move the white object to the bottom left corner": 32,
 "put a clear basin on the left burner": 49,
 "move the green linen to the top left corner of the table": 36,
 "get the spatula in the sink and move it inside the yellow basket": 56,
 "move the can to the lower right corner of the stove": 37,
 "put the green objects between the burners": 23,
 "Move the pot to below the pepper.": 28,
 "move the violet object to the left upper side of the table": 19,
 "Put the pot on top of the cloth.": 34,
 "Picked up the sphere and moved it to the back left of the table": 36,
 "move the purple cloth on the upper right of the stove.": 18,
 "put the red tomato in the drawer": 35,
 "take the rose doll from the drawer and put it down": 42,
 "move the lid to the immediate left of the purple cloth": 26,
 "moved the green teddy bear to the left side of the drawer": 29,
 "Move the toy to the corner of the table": 46,
 "take blueberries off plate sink": 60,
 "move the green fruit on top of the drawer": 29,
 "move the green pepper to the center of the stove": 25,
 "Put the green sausage in the pot": 32,
 "put the food in the front right on the table": 43,
 "Move the strawberry to the left of the silver bowl": 46,
 "put blueberry on plate and potato in pot or pan on stove": 76,
 "put the white arch on top of the red hexagon": 46,
 "moving the red spoon to the upper right burner": 35,
 "move the brown thing to the right side of the drawer": 28,
 "put green object on cylinder and yellow cube": 46,
 "put the banana in between the two middle switches": 38,
 "put the triangle on top of cylinder": 46,
 "Move the red pepper over the lower left corner of table.": 46,
 "put the blue object to the bottom right side of the table": 28,
 "close brown1fbox flap": 126,
 "Move the fork in front of the banana.": 41,
 "Place the mushroom to the lower right of the spoon": 26,
 "Fold the cloth from right to left": 69,
 "move blue brush to the right burner": 35,
 "Pick up the pot and place it behind the blue spoon": 46,
 "video frames or not showing": 39,
 "Move the the spoon from edge to corner of the table.": 46,
 "put the red arch on the right side of the table": 46,
 "Place the green towel to the right of the green spatula": 34,
 "Place the laddle behind the cloth.": 46,
 "Put the pot on the orange cloth.": 27,
 "Place the blue brush to the right of the purple towel": 39,
 "place spoon inside silver bowl": 44,
 "move the blue cloth to the right side of the salt pot": 25,
 "Put the meat on the middle bottom of the table": 46,
 "Move the white and black object below the left burner.": 23,
 "Move the blue cloth behind the sushi": 26,
 "Move the can in the front centre of the table": 31,
 "opened the drawer.": 20,
 "puts the egg in the silver pot": 24,
 "took the circular bar and put it on the right side of the table": 46,
 "put blue toy on the vessel": 29,
 "Place the drumstick to the left of the blue spoon": 39,
 "Move the orange fabric to the top right corner of the table.": 34,
 "move the wooden spatula to the upper side of the sink": 52,
 "Slide the towel to the bottom of the counter.": 38,
 "picked a red thing and placed it on top of an orange cloth": 35,
 "move the blue object from  the bottom left of the cloth to the left of the table": 32,
 "move the green pepper to the bottom left burner": 31,
 "put the cuboid into the pot": 46,
 "put the cylinder to the top of the blue cube": 41,
 "take the orange cloth out and put it in the basket": 32,
 "move the silver pot below the yellow cloth": 33,
 "remove the yellow block on top of blue block to the right side of the table": 34,
 "Put the mushroom to the right of the spoon.": 23,
 "put sweetpotato on plate and stuffedelephant in pot or pan on stove": 61,
 "Placed the shinning pot on top of the yellow cloth on the right side of the burner": 29,
 "put the yellow object on the bottom left burner": 40,
 "move the white basket to the right side of the washing machine": 36,
 "place the blue object in between the bottom left burner and the bottom right burner": 21,
 "Pick up the knife from left side of the table and placed it on the blue cloth on right side of the table.": 46,
 "move the cheese to the far edge of the table": 38,
 "put the suit on the yellow piece": 31,
 "put the red figure on top of the green figure": 46,
 "mova a lata para o lado direito da panela": 22,
 "put the yellow pepper on top of the purple cloth": 32,
 "Place the pot on top of the yellow towel": 86,
 "Put the mushroom in front of the blue cloth.": 38,
 "move the red object to the upper left side of the table": 24,
 "move cheese to pot": 39,
 "put the cup on the right side of the ball": 42,
 "move the red object to the right side of the table": 41,
 "take the yellow block off of the green cube and put it on top of the green arch": 46,
 "Move the cloth from front to the back behind the spoon": 37,
 "take the green box and put in the table": 34,
 "push the blue towel to left bottom corner of the table": 26,
 "Move the toy to the center of the table": 46,
 "Take the blue cloth and place it on the right side of the fork.": 45,
 "take the red spoon from the left and put it on the right stove": 29,
 "move the red thing to bottom left of burner": 28,
 "Move the yellow capsicum out of pot and place it onto the table.": 37,
 "put the covering lid on top of the silver pot": 45,
 "move the silver pot to the left side of the table": 42,
 "put the broccoli on the blue cloth": 28,
 "put the ball on top of the square with hole in the middle": 46,
 "put the brush on the left side of the table": 42,
 "move the purple towel to the bottom left side of the table": 35,
 "move the orange fork from the top of the green cloth to the bottom of the heater": 41,
 "Move the pot and place it on top of the towel.": 28,
 "move the silver pot to the upper right side of the burner": 39,
 "move the red fork to the top right burner": 30,
 "push the gray object to the top left of the stove and put the blue brush on the right burner": 46,
 "PICK UPTHE  TOWEL PUT ON THE ANOTHER SIDE OF THE TABLE": 35,
 "put the lid on top of the silver pot": 28,
 "puts plastic brush into silver pot": 49,
 "Pick up the blue spoon and place it on the left of the pot": 45,
 "nothing do": 37,
 "move the green cloth from the washing machine and put it in the white basket": 46,
 "fold the cloth from bottom left to upper right": 43,
 "move the object and place it above the drawer.": 21,
 "Put the spoon right on top of the napkin.": 38,
 "Move the blue towel to the left edge of the table": 28,
 "move pear to towel": 43,
 "move the green thing to the upper left side of the table": 34,
 "unfold cloth from bottom left to top right": 29,
 "put the yellow object in the silver pot at the bottom right of the cooker": 25,
 "move the yellow cloth to the right burner": 44,
 "doblar la tela de abajo a la derecha de arriba a la izquierda": 36,
 "Placed the egg near the pan.": 35,
 "Take the blue cube to the left side of the table": 45,
 "doing nothing": 46,
 "PICK UP THE VESSEL AND PUT ON THE ANOTHER SIDE OF THE TABLE": 46,
 "Pick up the pot and place it on the right of the green cloth and eggplant": 42,
 "put the green object on the bottom left burner": 26,
 "Place utensil in between towel and pot.": 46,
 "folds from top left to bottom right": 42,
 "Move the colander to the front left corner of the table": 28,
 "put the spoon to the upper left side of the burner": 23,
 "Move the silver vessel and place it on the center of top of the table.": 33,
 "Pick up the red fork and place it on the left of the pot": 38,
 "move the silver pot over the green fabric at the top center of the table": 28,
 "cerró el cajón": 41,
 "move the yellow knife to the left of the table": 37,
 "moved the pink object to the lower left of the stove": 55,
 "put the cover to the top right corner of the table": 39,
 "move the green cube from the red block and put it on the table": 34,
 "put the potato in the red pan": 40,
 "moved the silver pot above of the right burner": 24,
 "Slide the canned good back so that it touches the wall.": 39,
 "Pick up the green sausage and placed it on left side of blue cloth": 41,
 "pick up the silver pan and place in to the upper right side of the table": 23,
 "put out the object inside the box": 27,
 "unfold the cloth yellon on the top left in the table": 39,
 "put the mushroom to the upper left side of the table in front of the microwave oven": 34,
 "take the pot and put in the sink": 53,
 "move the green fork to the front of the stove": 28,
 "Fold the cloth from the bottom left to the top right": 46,
 "moved the red thing from the bottom right of the cloth to the right side of the cloth": 30,
 "Pick up the spatula and put it down left side of pot": 46,
 "move the yellow duck from the top of the drawer to the table": 26,
 "put the fork in the pot": 46,
 "Move the orange cloth over to the left side under the spoon": 30,
 "move the orange cloth to upper left of the burner": 22,
 "fold the cloth from the bottom to the top on the table": 35,
 "put the black and white figure on the left edge of the cloth": 33,
 "moved the black object from the top of the drawer to the table": 31,
 "move the silver bot to the bottom left of the stove": 44,
 "Move the sushi and put inside of the pot.": 36,
 "moved the knife from the top left corner of the table to the middle right of the table": 53,
 "move the blue object from the bottom left edge of the cloth to the left of the table": 39,
 "fold the cloth de left to right": 39,
 "move the red bar above the yellow spoon": 34,
 "move sushi to left of towel": 33,
 "put the rectangle on the left side of the table onto the top of the blue rectangle.": 42,
 "Move the bowl in front of the blue fork": 32,
 "Move the silver pot to the bottom right corner of the stove top.": 28,
 "move the orange cleaner to the upper stove": 31,
 "Place the pot on the yellow cloth.": 42,
 "put spoon to the left of the pepper": 27,
 "move the red object off the cloth": 40,
 "Place the spoon in front of the can.": 38,
 "move the orange cloth to the lower left side of the stove": 28,
 "move the can to the right side of the silver pot": 18,
 "Move the blue thing from the cloth to right side of the table": 32,
 "moved the lid of the metal pot on the on upper corner of the right burner or stove": 37,
 "move brush onto yellow": 32,
 "move the pan on  the top middle of the burner": 24,
 "move the sushi from top of yellow cloth to the left of the table": 29,
 "move the clothe from left to right": 22,
 "Place the banana beside the purple towel, near the far edge of the table.": 46,
 "Move the yellow cloth to the centre of the table": 34,
 "move the blue clothe to the right side of the table": 23,
 "moved the red tin the to the bottom left side of the table": 41,
 "put the square block on top of the rectangular block with a red mark": 41,
 "remove the yellow figure from the cloth to the table": 38,
 "Move the spoon closer to the microwave and cans.": 31,
 "move the banana to the lower left side of the table": 23,
 "placing the green towel on the right side of the table": 28,
 "Move the colander to the bottom left side": 39,
 "put the object from the cloth to the center of the table": 27,
 "move the blue cloth to the upper right corner of the stove": 20,
 "put the blue spoon in the silver pot": 31,
 "move the cloth to the right edge": 23,
 "move the green toy from the drawer to the left side of the table": 26,
 "put the croissant on the bottom right corner of the stove": 31,
 "move the cloth to the bottom of the table": 35,
 "move the silver pot to the bottom of the right burner": 35,
 "Colocar la olla plateada con el pimiento amarillo en el quemador izquierdo": 49,
 "Move the pot so it's under the spoon.": 38,
 "Move pot from on top of the towel and place it to the right side of the mushroom.": 23,
 "put the yellow rectangular block on top of the yellow cube": 46,
 "Grab the silver bowl.  Move it down and to the right.  Place there.": 35,
 "Move the stirring spoon to edge to other side of the table.": 43,
 "Move the spatula towards the bottom of the counter.": 45,
 "move the brown container to the top edge of the sink": 56,
 "put the yellow banana to the upper right burner of the stove": 28,
 "Place the green vegetable in the silver pot.": 43,
 "Place the orange carrot inside the colander": 36,
 "Move bowl to center of table": 32,
 "Move the pot and place onto green towel": 46,
 "move the green towel into the middle of the table": 47,
 "Move the red spoon from right to left side of the pot": 39,
 "Move the pot to the empty corner.": 34,
 "took the salmon nigiri from the table and put it on the purple towel": 38,
 "moved the plate to the near bottom right burner": 42,
 "put the cylinder on top of the table": 27,
 "move the yellow object to the bottom side of the table": 22,
 "put a yellow piece in the drawer": 30,
 "take the box and put in the top of another box": 46,
 "Place the pot to the right of the green napkin, near its bottom right hand corner.": 44,
 "put stuffedduck in pot or pan an put pot or pan on stove": 76,
 "take black doll out of the drawer and place it on top of the drawer": 33,
 "Move the pot to the top right of the table.": 41,
 "take the block from the tower and put it on the right side of the table": 46,
 "Put the mushroom between the pot and the cloth": 20,
 "moved the purple cloth between the silver pot and orange spoon pushing the yellow object between the stove and sink": 36,
 "fold the cloth left to right": 31,
 "Place the colander on top of the orange towel": 39,
 "Move the silver pot in the Orange cloth to the underneath left burner": 36,
 "move the pink elephant to the middle part of table": 26,
 "move the can to bottom left of table": 40,
 "Move the pot on top of the napkin": 43,
 "move the green cloth to the middle of table": 41,
 "grabbed the silver bowl and moved it to the right onto the burner": 36,
 "put the battery inside the drawer": 34,
 "Put the red bell pepper in the metal pot.": 35,
 "put white block on top of the triangular": 46,
 "Place the blue cloth in front of the two cans.": 17,
 "move the can on the edge of the burner": 43,
 "moved one can to the top left side": 37,
 "unfold the clothe from top left to bottom right": 71,
 "move the blue cloth to the right side of the table": 16,
 "Put the pot on top of the napkin.": 45,
 "moved the green cloth to the lower side of the left burner": 29,
 "Move the cloth to left front of table.": 24,
 "bring the blue cloth to the front edge from the back": 34,
 "Move the spoon to the left side of the pot": 46,
 "put the yellow cube on top of the red cube": 46,
 "retirez le cube de la tour et placez-le au milieu de la table": 46,
 "Move the red strawberry to the left of and behind the towel": 46,
 "move the blue object to the middle of the table": 24,
 "take the white object and put it in the silver pot": 24,
 "pick the cone block and put it on top of the assembled blocks": 46,
 "put the silver pot on top of the purple towel at the top right side of the stove": 40,
 "move the square with a hole to the right side of the table": 38,
 "closed the drawer on the table": 25,
 "closing the drawer": 31,
 "Put the silver pot on the left stove burner.": 39,
 "move the plastic spoon to the bottom left corner of the burner": 27,
 "Pick up the spatula and place it to the left of the pot": 29,
 "Move blue cloth behind metal pot to the right towards yellow scoop.": 22,
 "move  the yellow cube from the stack to the right side of the table": 40,
 "Take the mushroom from the pan to the front left corner.": 30,
 "Move the cheese next to the knife.": 42,
 "straightened the cloth from right to left": 20,
 "Take item from the pot and put it on the towel.": 38,
 "put the cylinder on red cube": 37,
 "plier le tissu de bas à droite vers haut gauche": 40,
 "move the spatula to the bottom of the yellow drainer": 44,
 "dyeing cloth": 39,
 "move the lid to the top of the silver container": 26,
 "pick up the violet cloth and place it below the right burner": 20,
 "put potato on plate and blueberry in pot or pan on stove": 123,
 "put the blue object inside the silver pan": 41,
 "fold from the left to the right": 43,
 "Place the green object on the bottom right side of the table": 46,
 "Move the chicken wing and place it in between the silver pot and the spoon.": 26,
 "Put the red object between the blue spoon and the purple towel": 32,
 "Pick up the chicken and place it at the back of the table behind the eggplant": 41,
 "Put the Blue spoon on top of the green cloth": 27,
 "move the cloth from left to right and back again": 45,
 "moved the blue spatula on the top left of the oven": 46,
 "put pickle on plate and cauliflower in pot or pan in sink": 76,
 "opens the drawer": 38,
 "fold the cloth from bottom right to the left": 30,
 "move the orange object from the left of the cloth to the right": 46,
 "Place the yellow cloth behind the toy": 39,
 "move vessel from top right to top bottom": 40,
 "put the pot lid over the yellow pot": 36,
 "Put the red object to the right edge of the cooker": 46,
 "put the yellow block on the tower": 46,
 "put the purple cloth on the right burner": 21,
 "move the can to the bottom left of the table": 21,
 "move the white cloth in the middle of the table": 34,
 "move the corn to the middle of the table": 38,
 "move the tin to the right side of the table": 39,
 "put the potato on the green cloth": 46,
 "move the spoon up on the table": 54,
 "put the green object in the pot on the left burner": 38,
 "Move the spoon and place it just below the towel.": 46,
 "put the red to the top of green": 41,
 "Place the yellow spoon in front of the metal pot.": 41,
 "put the blue cloth  on the other side  of the table": 24,
 "unfold the cloth from top to bottom": 157,
 "fold from the right to the left": 28,
 "no moves": 39,
 "Pick up spoon and move it next to the blue towel.": 29,
 "move the cloth to the  bottom right of the table": 23,
 "Move the green block on top of the blue block in the right side": 46,
 "Move  the pine tree shape at the center of the table": 41,
 "end effector reaching knife": 32,
 "open the drawer and push back in a little": 43,
 "fork to the right side of the stove": 46,
 "Placed the silver pot on the bottom left burner": 34,
 "put the yellow block on top of the green cube": 46,
 "place the red pan over the yellow cloth": 41,
 "pick the silver lid lying on the burner and put it on the silver pan on the left": 32,
 "PLACE THE ORANGE CLOTH AT THE CENTER EDGE OF THE TABLE": 19,
 "move the purple figure from top of the top of the table": 40,
 "move the knife near the pot on table": 41,
 "move the green arch from vertical to horizontal": 42,
 "put blueberry in pot or pan an put pot or pan on stove": 73,
 "turn faucet front to right": 63,
 "take the cylinder the left": 34,
 "Put the meat on the right side of the pan": 31,
 "move the blue spatula to the top left of the stove": 31,
 "place the money pot on the purple cloth.": 24,
 "place the green utensil to the right of the blue cloth.": 45,
 "pick the white basket and put it on the left side of table": 32,
 "put the pot lid on the silver pot": 36,
 "moved the silver lid to the center bottom of the burner": 20,
 "Move the mushroom to the bottom right of the table near the stove.": 41,
 "move the basket to the right side of table": 38,
 "move the blue cup to the upper right of the table": 43,
 "move the pot to the lower left corner of the table": 36,
 "moved the brown pot from the middle to the right side of the table": 37,
 "move the cloth to the top right of the burner": 28,
 "Move the blue spoon to the left of the table": 42,
 "move the red thing in the right side of the table": 24,
 "remove the blue block from the middle and put it on top of the blue rectangular block on the right": 46,
 "put the blue block in the middle": 39,
 "put cauliflower on plate and pickle in pot or pan in sink": 69,
 "Place the silver bowl on top of the blue towel": 41,
 "fold cloth from left to right": 65,
 "put down the white arch in the table": 46,
 "take the silver lead and close the pot": 30,
 "move the silver pot in the lower right of the stove": 35,
 "Move the blue object and place it above the red object": 35,
 "take the silver pot and place it on the lower right burner": 28,
 "put the brush into the silver pot": 42,
 "move the blue cube beside the wood cylinder": 33,
 "move the cucumber to the lower left side of the burner": 22,
 "Move the blue cloth to the left front corner of the table.": 21,
 "put the white mushroom in the silver pot": 30,
 "put eggplant on plate and largepotato in pot or pan in sink": 76,
 "move silver pot between two burner": 36,
 "put the yellow cube in top of the rectangular cuboid": 40,
 "move the red fork to the right side of the table": 29,
 "put the silver lid on top of the silver pot": 32,
 "Move the mushroom into the pot.": 26,
 "Put the pot in the middle of the burner.": 39,
 "take the potato and place it onto the green towel": 36,
 "moved the yellow cloth to the right side of the table": 27,
 "Move the bowl off the cloth to directly underneath it": 29,
 "Place the pot on the cloth.": 40,
 "move the green cloth in front of table": 45,
 "pull the bottom left corner of the cloth": 31,
 "Place the bowl to the right of the blue spoon": 28,
 "put the blue cloth in the middle of the table next to the yellow knife": 26,
 "Move the cloth to the right in front of the cans": 26,
 "Moved the silver pot to the left side of the can.": 32,
 "put the yellow bell pepper inside the drawer": 46,
 "put the red object on top of the drawer": 30,
 "folds the cloth from bottom right to top left": 44,
 "Place the spatula on top of the orange cloth.": 24,
 "Place the croissant inside the colander": 33,
 "put pear on plate and bread in pot or pan on stove": 147,
 "Move the fork to the left side of the pot.": 46,
 "folded the cloth from bottom to top": 32,
 "Folding The Already Folded Cloth Into The Top Right": 38,
 "put the circle on top of the cylinder": 46,
 "remove the red lock from the tower and put it t the left": 37,
 "put the pawn on top of the white cube": 39,
 "place the lid into the left side of the table": 28,
 "moved the red object to the bottom right burner.": 27,
 "move green spatula to lower right corner": 45,
 "drag the can on top of the left burner to the upper right corner of the stove": 24,
 "put the spatula on the top left of the table": 50,
 "REMOVE YELLOW TO END OF THE TABLE": 34,
 "move the orange object to the upper left side of the table": 33,
 "move the cloth from bottom left to the top right of the table": 46,
 "move the blue fork to the front of the ketchup": 33,
 "Move the silver pot to in front of the red spoon": 36,
 "move the can to the bottom left corner of the stove": 53,
 "put the cylinder on top of the blue rectangular block": 37,
 "move pear to just right of towel": 28,
 "moved the orange pot next the red bell pepper": 45,
 "put the blue arch on the yellow block": 41,
 "Place the capsicum into the steel pot.": 35,
 "put the red arch on top of the blue rectangular cube": 46,
 "move the yellow cloth near the blue spoon.": 35,
 "move the towel straight back to the edge": 40,
 "Pick up the pot and place it on the napkin.": 41,
 "Put the cloth to the left of the spoon.": 28,
 "put the green arch on top of the block": 46,
 "take the silver lid and place it to the lower edge of the right burner": 31,
 "move silver pot to upper right burner": 29,
 "move the purple cloth to the left side": 23,
 "Move the purple towel between the metal pot and the spatula.": 46,
 "Move the pot and put it on top of the yellow cloth.": 41,
 "removed the banana from the drawer": 36,
 "move pot to just right of blue spoon": 32,
 "move the white basket in the left side of the yellow cloth": 29,
 "take the green bear stuffed toy. And then it grab the green bear and put it near the house box": 23,
 "Take the yellow object in the furthest right side of the burner": 28,
 "move the blue cloth  to the left burner": 41,
 "move the blue cube to the right": 42,
 "remove the yellow cube from the tower and put it on top of the blue tower": 39,
 "Pick the vessel from left side and pace it cloth": 32,
 "moved the blue cloth from the basket to the right side of the wood": 29,
 "Move the spoon to the left of the purple towel.": 45,
 "Place the purple shape directly above the silver bowl.": 35,
 "put the green triangle on top of the tower": 46,
 "Move the blue brush in the left side of the burner": 36,
 "put the silver pot on the right burner": 37,
 "The robot arm grabbed the saucepan and put it on the right side of the orange table cloth.": 45,
 "move the ball to rleft": 29,
 "Unfolded the cloth from bottom to top": 46,
 "move the orange towel from the white box to the washing machine": 46,
 "Move the cover to the lower left burner": 29,
 "Move the cloth to the left": 25,
 "Push the napkin closer to the pot.": 38,
 "put the green spatula to the right side of the orange pan": 51,
 "take the arch off of the blue arch and put it on top of the rectangular block": 46,
 "Move the silver pot and place it on the lower right burner.": 31,
 "moves the yellow knife, to the upper side of the table": 44,
 "unfold the cloth from the centre to the bottom left": 32,
 "Pick up the red cup and put it on the blue napkin": 46,
 "unfold the cloth from right to the left": 31,
 "put the silver pot on the green cloth": 30,
 "fold cloth bottom left to top right": 32,
 "The machine arranges the cubes": 29,
 "move the spatula to the top side of the right stoves": 46,
 "unfold the right side": 30,
 "Move the cloth right behind the silver pot.": 28,
 "put the steel cover over the steel pot": 33,
 "move the purple can to the left side of the silver lid": 23,
 "moved the red fork and put it on the left side of the table": 38,
 "move spoon right below microwave": 30,
 "move the corn to the top right burner": 31,
 "take the silver pot and place it between the blue can and microwave": 31,
 "put the banana on the left edge of the cloth": 28,
 "unfolding the cloth": 37,
 "fold the cloth from top right to center": 33,
 "Pick up the pot and place it behind the purple cloth": 32,
 "take the green cloth and moved it from top left to bottom left": 30,
 "move cloth diagonally from top to bottom towards right": 35,
 "move the red pot to the bottom left side of the table": 36,
 "fold cloth from right to left.": 37,
 "picking a sufuria": 26,
 "hold the cloth in top left  and drop to bottom right": 18,
 "move the green block to the center of the table": 29,
 "put the red spoon to the left burner": 26,
 "put the blue block on the red block": 46,
 "moved the green cloth to the right side": 38,
 "put the silver pot at the centre of the table": 36,
 "Move the pot to the back left of the table.": 26,
 "take the blue cloth from the washer and put it on the table": 31,
 "Move the red fork to the top right of the stove": 37,
 "Open the pot and place the lid to the top middle of the table": 46,
 "Move the red spoon behind the pot": 46,
 "Move the spatula in front of the cans.": 32,
 "move the croissant and put it on the right side of the burner": 41,
 "Place the yellow cloth on the back right corner of the table.": 29,
 "move the yellow object to the lower mid part of the table": 32,
 "Pick up the green vegetable and place it in the bowl": 33,
 "move blue fork to the corner near yellow cloth and red spoon": 45,
 "move the brown pot to the top left corner of the stove": 27,
 "move the purple cloth to the right corner of the table": 23,
 "Move the blue towel to the left of the washer": 27,
 "move the ladle to the top of the table": 34,
 "move the yellow object out of the drawer and to the left side of the table": 46,
 "move the carrot to the lower right burner": 25,
 "Move the cloth and the fish to above the pan": 35,
 "move the cylinder block to the right side of the table": 46,
 "Put the pot between the spoon and mushroom": 33,
 "placed the silver pot on the right burner": 25,
 "Déplacer le tissu de bas à droite vers le le haut à gauche": 21,
 "pick the banana and put it on the left stove": 41,
 "put the purple object on the orange cloth": 32,
 "plier le tissu de bas vers le haut": 46,
 "move white table cloth to the bottom left of cooker": 51,
 "put the carrot in the silver pot": 45,
 "place the pink cup on its side at the bottom of the table": 46,
 "Move the cloth closer to the bowl.": 38,
 "put the block on top of the block with a hole": 46,
 "Place the can between the spoon and pot": 38,
 "Move the thing from the top right burner close to the yellow corn.": 46,
 "Place the spatula on the green cloth": 39,
 "put the yellow cheese in the drawer": 26,
 "moving the pot to the left": 52,
 "PICK UP THE YELLOW TOWEL AND PUT ANOTHER SIDE OF THE TABLE": 37,
 "put the wooden spatula on the top of red pot": 47,
 "Place the spatula just behind the bottle": 46,
 "take the eggplant out of the drawer and put it on the right side of the donut": 40,
 "Move the blue utensil to the center back of the table against the brick wall": 44,
 "move the silver pot to the top right of the table": 32,
 "removing the orange wash cloth from the washer": 39,
 "Picked brown object and place it in a sober object on the upper left of burner": 41,
 "picked a red cube from a tower and placed on the table": 30,
 "move the silver pot to the left side of spoon": 30,
 "PICK UP THE WHITE TOWEL AND PUT ANOTHER SIDE OF THE TABLE": 22,
 "move the silver pot on the middle of the burner": 31,
 "Puts the blue spoon on top of the cloth.": 46,
 "Put the blue cube on top of the red cube": 43,
 "Take out the blue cloth from the white basket": 38,
 "put silver pot on the left burner": 46,
 "put egg plant to the silver pot on right side of the burner": 23,
 "no changes were done": 29,
 "move the silver pot over the lower right burner": 28,
 "Place the sausage on the top left of the stove near the blue spoon.": 27,
 "move the green block on top of the hexagon": 44,
 "move the silver pot to upper of the right stove": 38,
 "move the silver pot from the left burner to the opposite right burner": 25,
 "put the orange figure on the top edge of the table": 44,
 "Pick up yellow knife and move it right past the green cloth": 34,
 "put the figure to the top right of the cloth": 43,
 "move the blue towel to the left": 35,
 "take the grapes and put it in the silver pot": 19,
 "move the pear onto the green napkin": 39,
 "Move silver pan from top left to top right of burner.": 24,
 "moved the silver pot from the lower right burner to the lower left burner": 31,
 "Place the yellow stick on the purple cloth.": 33,
 "move the silver pot to the right side of the orange towel": 22,
 "remove the yellow block from the center of the table to the left side": 46,
 "put the yellow duck at the bottom right of the table": 34,
 "Move the silver pot to the top right side of the blue sink": 43,
 "place the silver lid over the silver cookware then place it on the left side of the table": 29,
 "Put the tomato on top of the purple towel": 26,
 "put the silver pot on the stove": 36,
 "Move the white basket on the blue clothe to right side of the table": 32,
 "put the red rectangle on top of the blue cube": 46,
 "take the croissaant out of the pot and out it on the upper left of the table": 34,
 "placed the pot upside down": 78,
 "move the silver pot to the bottom right burner": 30,
 "Pick up the green object and place it on the bottom left side of the table": 33,
 "Move pot to bottom left corner of table.": 31,
 "Place the pot behind the blue towel": 35,
 "put the blue spoon on the upper right part of the left burner": 28,
 "fold the cloth from top right to left bottom": 39,
 "take the silver bowl and puts it on top of the orange cloth": 43,
 "move the brown puppy near the silver pot": 35,
 "put the corn a few inches to the right": 30,
 "pick the left orange vessel and put it back on the right side of orange cloth": 46,
 "Pick the carrot from left side and place it on the orange cloth": 34,
 "Hold the black roll from inside the steel pan and place it on right edge of the table.": 34,
 "put the plus on top of the white cube": 46,
 "take the with object out of the pot and put it on the left burner": 57,
 "put the banana in the drawer": 30,
 "move the orange pot to the top right burner": 50,
 "moved the can on the bottom right of the burner": 32,
 "Put the spoon to the left of the pot.": 73,
 "slide the bowl to the upper right corner of table": 37,
 "Place the pot on top of the towel.": 46,
 "Put the blue item near the tip of the spatula.": 46,
 "Move the hot dog towards the top of the table.": 27,
 "The robot arm took the blue object and placed it inside the saucepan.": 43,
 "put the silver pot on top of the orange cloth": 32,
 "move the banana to the bottom left side of the cloth": 22,
 "fold the cloth from": 39,
 "move the red rectangular block on top of green rectangular block": 38,
 "Move the fork and place on towel": 36,
 "move the blue object on the lower left side of the stove": 33,
 "put the blue arch block on top of the yelow cube and the red cube": 46,
 "put a red object inside a silver pot": 33,
 "put the green pepper inside the silver pot": 49,
 "move the silver pot next to the faucet": 50,
 "put the brush on the orange cloth": 33,
 "move the blue cup in the right side of the sink": 50,
 "put the object to the left lower side of the table": 31,
 "Close the drawer.": 30,
 "fold the cloth from bottom left to the middle": 35,
 "move the green cloth in the bottom of the table": 25,
 "Put the container in the vessel.": 39,
 "Move the silver pot to the left side of the jiko": 35,
 "Move red-handled fork to the left and away from the orange cloth.": 39,
 "Move can to the left side of the table": 40,
 "move the yellow with green checked box from center of the table to top middle of the table": 36,
 "Place the blue brush between the bowl and the red ball.": 46,
 "Moved the silver pot from the lower right side burner in the upper right side burner.": 37,
 "move the utensil and place it on the green cloth": 45,
 "move green object to the top of the cloth": 39,
 "remove the cube from the tower and put it on the right side of the table": 44,
 "moved the red pepper to the middle of the four temperature knobs": 25,
 "Move the blue cloth to the back left corner of the stove.": 26,
 "Put the pan on top of the yellow cloth.": 46,
 "Move the spoon and place top left under microwave": 31,
 "put the orange cloth": 38,
 "déplacer un t- shirt vers milieu entre les deux bruleurs": 30,
 "moved the pot to the right burner": 34,
 "move the silver pot to the bottom right corner of the burner": 24,
 "Pick up the object beside the cabinet": 46,
 "moved blue spoon to the top left of silver pot": 25,
 "Put the spoon in the middle of the napkin.": 42,
 "move the silver pot to the upper left side of the burner": 31,
 "move the orange pot to the lower left side of the table": 30,
 "place red ball on the green cloth": 31,
 "put the green cube on the blue block": 41,
 "put the gray pot in the center of the table": 39,
 "Move the blue towel to the front edge of the table": 20,
 "put the white object into the sliver pot": 46,
 "Move the orange towel from bottom right to bottom left of the burner": 22,
 "put the green arch on top of the blue arch": 46,
 "put the black item to the sink": 54,
 "Move the blue cloth to the right end of the table next to the spoon.": 30,
 "Put the orange in the pot.": 25,
 "move the cloth to left side of the table": 35,
 "move the light blue cloth to the bottom of the table": 28,
 "Move the potato to the right of the pan.": 27,
 "Place the tomato to the right of the red fork": 36,
 "move blue cloth to the bottom middle of the table": 28,
 "move the orange object to the lower right of the right burner": 28,
 "unfolded from top right to bottom left": 36,
 "moved the plastic container from the pot to the table": 35,
 "move the yellow towel to the left side of the stove": 34,
 "place the cloth to the center of the  table": 40,
 "take the handle and open the drawer": 32,
 "Pick up the spoon and place it on the right of the pot": 46,
 "Placed the marked wood far end": 38,
 "move the red fork in the upper right side of the burner": 30,
 "take the red thing and put it on the top of the drawer": 26,
 "move the white thing in the center of the table": 33,
 "moved the corn to the lower right side of the table": 27,
 "moved the silver pot to the lower right side of the table": 31,
 "move the green-black-striped can to the middle of the table to the top of the blue cloth": 29,
 "move the mouse next to the brush": 36,
 "Remove the triangular block from the tower and put it on the table": 46,
 "Move the corn to the middle bottom of the table": 45,
 "put a blue thing into the drawer": 33,
 "Place the mushroom on top of the blue towel": 25,
 "get the bread and put it on the left side of the stove": 36,
 "put the can to the bottom right corner of the right burner": 26,
 "move the silver bowl to the right side of the table": 28,
 "Put the chocolate bar directly behind the silver bowl.": 27,
 "Place the pot on top of the towel": 46,
 "take the block on top of the arch and place it on top of the rectangular block on left": 44,
 "fechou a gaveta": 42,
 "fold the fabric top right to bottom left": 32,
 "move violet little bit on the right": 28,
 "put the robot arm do": 46,
 "move the silver pot on top of the green cloth to the right burner": 28,
 "move the can to the left of the silver pot": 22,
 "Pick up the pot and place it on the right of the egg": 39,
 "move the yellow cloth from the washer to the right side of the table": 31,
 "fold the cloth from top right to bottom left.": 36,
 "move fish to bowl": 38,
 "Move the yellow cloth from right bottom of the table to top right side of the table.": 27,
 "move the green spatula to the upper right burner": 36,
 "Move the spoon to the corner near the cloth.": 39,
 "move the red thing from right side of burner to silver pot": 21,
 "remove the yellow rectangular blocks from right tower and put it in the table": 46,
 "fold the cloth from right top to left bottom": 33,
 "Move the silver pot on the bottom left burner": 31,
 "Move the bread and place directly under microwave to the far left": 33,
 "put the silver pot in upper right side of silver basket": 32,
 "put bowl behind towel": 46,
 "put the spoon on the right side of the towel": 38,
 "moved the blue spatula to the left side of the table": 21,
 "move the brown pot beside the silver pot": 35,
 "move the can to the top left of the stove": 20,
 "Move the spoon to the middle of the table": 41,
 "unfold the cloth from left to righ": 34,
 "put the yellow brush to the bottom of right burner": 41,
 "Move the blue spoon from the middle of the table to the left of the table": 21,
 "put the blue towel in the washing machine": 36,
 "move silver pot from bottom left of the table to top middle of the table": 28,
 "move the cloth to the top left of the table to the bottom right": 31,
 "Move fork to left of pot.": 32,
 "move the yellow object to the upper right side of the stove": 30,
 "move the red capsicum to the right bottom edge of the stove": 26,
 "move the orange cloth to the right side of the stove": 29,
 "Pick up the red pepper and place it in the pot": 46,
 "put the red block on top of the cylinder": 46,
 "move the spatula to the left side of the burner": 29,
 "Place red ladle in the saucepan": 40,
 "move the blue spatula to the bottom right side of the table": 27,
 "pick the yellow corn in the metal pot and put it between the burners": 33,
 "move metal bowl to left of green towel": 42,
 "put the stainless": 23,
 "Put the spoon to the right of the pepper.": 22,
 "moved the brown thing near the bread": 45,
 "Move the blue cloth to the right front corner of the table.": 21,
 "move the yellow object to the top right of the burners": 27,
 "Pick up the pan and place it on the blue towel": 33,
 "move the silver pot to the left side of the stove": 37,
 "move the towel to the top of washing machine": 29,
 "move the eggplant to the right side of the bell pepper": 29,
 "Move the can to the right of the table": 37,
 "Pick the blue spoon and place it on blue towel": 26,
 "put the green cube on top of the green rectangle": 46,
 "Move the cloth to the front right corner of the stove.": 21,
 "Pick the hot dog from middle of the towel and place it on the corner": 29,
 "move the cloth from left to the top of the table": 21,
 "Place spoon on left of edge table to the left of pot": 28,
 "put the red object on the top on group object.": 46,
 "Move the yellow cloth to the near edge of the table": 28,
 "move the yellow knife to the upper left of the burner": 32,
 "put the cupcake inside the drawer": 43,
 "moved the lid from the yellow cloth to the top of the pot": 25,
 "move the silver pot to the lower left burner": 24,
 "move the silver pot to the bottom right of the table": 32,
 "Place the green spatula above the silver pot.": 23,
 "put the green thing to the bottom right side burner": 21,
 "move the white food to the top of the cloth": 36,
 "make the lid over the lower burner on the right": 25,
 "Pick up the eggplant and place it on the cloth": 38,
 "put stuffedduck on plate and egg in pot or pan on stove": 60,
 "Move the silver pot with eggplant to the upper left burner": 47,
 "move the cylinder to the bottom right": 44,
 "Pick up the strawberry on top of the orange cloth, place it on the top left quarter of the table.": 36,
 "move items backwards": 42,
 "take the blue things out of the cabinet and put in the table": 37,
 "moved the orange pot to the left side of the table": 32,
 "Place the pan just behind the blue cloth.": 33,
 "fold the fabric from the top right to the bottom left": 40,
 "pushes the door of the drawer and closes it": 77,
 "Pick up the orange carrot and place it on the left of the blue spoon": 32,
 "put the blue brush in the orange pot": 42,
 "Pick up the spatula and place it in front of the table in front of the pot": 46,
 "move the can by using the yellow spoon to the upper right of the table": 46,
 "move the silver pot to the left side on the table": 40,
 "fold the cloth from bottom to the top": 38,
 "move the yellow cloth at the top burner": 30,
 "move the green object next to the left table": 33,
 "move the yellow brush to the right side of the orange pot": 34,
 "move the yellow bottle to the upper right corner of the table": 39,
 "moved the pink object into the silver pan": 31,
 "Move the orange cloth to the right of the pot": 41,
 "Pick the yellow item and put it inside the vessel": 42,
 "Move the pot so the handle is above the red spoon handle.": 45,
 "Moved one cup to the lower right  side of the table": 30,
 "take the rectangular block and put it on top of the rectangular": 46,
 "fold the cloth from  the left to the center of it": 34,
 "flip salt upright": 21,
 "put the lid on the pan": 33,
 "Put the bowl on the purple towel": 35,
 "Move the sushi roll to the left of the blue fork": 41,
 "take the red object and put it in the drawer": 46,
 "Move the napkin next to the fork.": 46,
 "Move the spoon between the cans and the mushroom": 37,
 "picked up the orange object and put it on top of the blue towel.": 22,
 "Place the napkin to the bottom right of the bowl.": 29,
 "put the cube with a hole on top of the plus": 39,
 "move the green spatula on the middle top of the two burners": 33,
 "moved the white figure from top left of the cloth to bottom right": 38,
 "Place the blue object into the pot.": 37,
 "move the pot to the left hottom side of the heater": 33,
 "put the rectangle cube to the top of ark": 38,
 "Pick up the blue fork from above the yellow cloth and placed it on table surface": 33,
 "Move the blue cloth to near the vessel.": 29,
 "move the orange cloth to the upper of the right burner": 27,
 "plier le tissu": 31,
 "put the silver basket in the middle of the sink": 56,
 "Pick up the orange and put it on the green towel": 34,
 "take one green arch and put it on white arch": 46,
 "put blue rectangle on red rectangle": 37,
 "moved the spatula to the bottom right corner of the table": 47,
 "move the yellow brush to the center of the table": 46,
 "move the object to the upper side of the table": 30,
 "move the arch on the right side": 46,
 "moved the silver pot in the upper left burner": 28,
 "Move the yellow cloth to in front of the red spoon.": 40,
 "put the rectangular block on top of the tower": 46,
 "move boutton to he right": 33,
 "Take the banana out of the wok and put it to the left.": 40,
 "Coloque el hexágono rojo en la parte superior izquierda de la mesa": 29
}